Repository: tahoma2d/tahoma2d_docs
Catalog: source/locale/*/LC_MESSAGES/installing_tahoma2D.po
Languages: es

source: Installing Tahoma2D
es: Instalación

source: Downloading Tahoma2D
es: Descarga

source: You can download the appropriate version of Tahoma2D for your operating system from the `Download page <https://tahoma2d.org/download/official_releases>`_ in the official Tahoma2D web site. Choose either the Windows or macOS version to start downloading the application.
es: Será posible descargar la versión correspondiente de Tahoma2D para el sistema operativo, en uso desde la `página de Descargas <https://tahoma2d.org/download.html>`_ del sitio oficial de Tahoma2D. Desde allí se podrá escoger la versión para Windows, macOS o Linux, y comenzar a descargar el programa.

source: All other builds apart from the ones downloaded from the official web site ARE NOT officially supported.
es: Toda versión que no sea descargada desde el sitio oficial CARECERÁ de soporte oficial.

source: Installing on Windows
es: Instalación en Windows

source: Download the Windows zipped file and follow these steps:
es: Descargar el archivo zip de Windows y seguir los siguientes pasos:

source: Extract the zip file.
es: Extraer el archivo zip.

source: Find the file called Tahoma2D
es: Buscar el archivo llamado Tahoma2D.exe

source: Double click and start drawing.
es: Hacer doble clic y ¡comenzar a dibujar!

source: Installing on macOS
es: Instalación en macOS

source: Download the macOS dmg file and follow these steps:
es: Descargar el archivo dmg de macOS y seguir los siguientes pasos:

source: Double click on the dmg package.
es: Hacer doble clic en el paquete dmg.

source: Drag the Tahoma2D program to the Applications folder (or wherever you would like it placed).
es: Arrastrar el programa Tahoma2D a la carpeta Aplicaciones (o donde se desee colocar).

source: Double click to open the app.
es: Hacer doble clic para abrir el programa.

source: Grant any necessary permissions.
es: Otorgar cualquier permiso necesario.

source: Start drawing!
es: ¡Comenzar a dibujar!

source: For macOS 15.0 and later, on the first open there might be a dialog with a warning message, since Tahoma2D is not part of the Apple Developer program. Choose “Cancel” or "Done" and then open ``System Settings --> Privacy & Security``. Towards the bottom, next to Tahoma2D, select “Open Anyway.” Then in the next dialog, provide an administrative password or choose “Open”. Afterwards, Tahoma2D will open normally.
es: En macOS 15.0 y posteriores, al abrir el programa por primera vez, es posible que aparezca un diálogo mostrando un mensaje de advertencia, debido a que Tahoma2D no forma parte del Programa de Desarrolladores de Apple. Elegir “Cancelar” o "Listo" y luego abrir ``Ajustes del sistema --> Privacidad y seguridad``. Hacia la parte inferior, al lado de Tahoma2D, seleccionar “Abrir igualmente”. Después, en el siguiente diálogo, proporcionar una clave administrativa o escoger “Abrir”. Después de esto, Tahoma2D se abrirá normalmente.

source: For most older versions of macOS, open through Finder the first time. Right-click on Tahoma2D and select “Open”. Then choose “Open Anyway”. Afterwards, Tahoma2D will open normally.
es: En versiones más antiguas de macOS, abrir mediante el Finder la primera vez. Hacer clic derecho en Tahoma2D y seleccionar “Abrir”. Luego, escoger “Abrir igualmente”. Después de esto, Tahoma2D abrirá normalmente.

source: Some versions of macOS will ask for permission to access the Desktop, Documents, and Downloads directories on the first time opening. If you decline permission, you may have trouble saving your work. Visit ``System Settings --> Privacy & Security --> Files & Folders`` if you need to fix folder permissions.
es: Algunas versiones de macOS solicitarán permisos para acceder a las carpetas Escritorio, Documentos y Descargas la primera vez que se use el programa. En caso de haberse denegado estos permisos, es posible que se presenten problemas al guardar el trabajo. Visitar ``Ajustes del sistema --> Privacidad y seguridad --> Archivos y carpetas`` para corregir los permisos de carpetas.
