Repository: tahoma2d/tahoma2d_docs
Catalog: source/locale/*/LC_MESSAGES/interface_overview.po
Languages: es

source: Interface Overview
es: Interfaz de usuario

source: The Tahoma2D interface is organized into rooms, also known as workspaces. Each room is a different collection of panels which are laid out at specific positions on the screen for a specific use.
es: La interfaz de Tahoma2D está organizada en espacios de trabajo: cada espacio de trabajo es una colección de diferentes paneles que están dispuestos en posiciones específicas en la pantalla, para facilitar alguna tarea específica.

source: Room Editing Mode
es: Modo de edición de espacios de trabajo

source: |UI_lock| "Room Editing Mode" allows for rooms to be added, removed, and renamed. It also allows for panels to be added, removed, or rearranged. To enter or exit "Room Editing Mode", click on the lock icon on the top right of the workspace.
es: |UI_lock| Al desactivar el botón "Bloquear espacios de trabajo" se permitirá la adición, eliminación o cambio de nombre de los espacios de trabajo. También permitirá agregar, eliminar o reacomodar los paneles del espacio de trabajo activo. Para ingresar o salir del *modo de edición de espacios de trabajo*, hacer clic en el ícono del candado, en la esquina superior derecha de la interfaz.

source: **How to identify "Room Editing Mode":**
es: **Cómo identificar el modo de edición de espacios de trabajo":**

source: When "Room Editing Mode" is unlocked, all of the panels have a visible header.
es: Cuando se esté en el *modo de edición de espacios de trabajo* (candado abierto), todos los paneles mostrarán sus barras de título.

source: Using Rooms
es: Uso de los paneles

source: Available rooms are listed on the far right of the menu bar. Each room always displays the contents of the current scene.
es: Los espacios de trabajo disponibles aparecerán listados en el menú **Paneles**. Cada uno de ellos mostrará siempre el contenido de la escena actual.

source: Rooms can be named and their order can be rearranged. New rooms can be added and existing rooms can be deleted. When a room is added it is empty; to configure it, panels can be added one by one (see below).
es: Es posible cambiar el nombre y el orden de los espacios de trabajo en la lista. También es posible agregar nuevos espacios de trabajo o borrar los existentes. Cuando se cree un nuevo espacio de trabajo, éste se encontrará vacío, siendo posible agregar paneles al mismo (ver más abajo).

source: To enter a room, click on the related tab on the far right of the menu bar. If "Room Editing Mode" is active, room tabs can be reordered by clicking & dragging the tabs to a new position.
es: Para activar un espacio de trabajo, hacer clic en la pestaña correspondiente en la esquina superior derecha de la interfaz. Cuando el *modo de edición de espacios de trabajo* se encuentre activo (candado abierto), las pestañas de los espacios de trabajo podrán ser reordenadas haciendo clic y arrastrándolas a una nueva posición en la lista.

source: **To name a room:**
es: **Para renombrar un espacio de trabajo:**

source: Double-click the tab and type the name you want to assign to the room.
es: Hacer doble clic sobre la pestaña correspondiente e ingresar el nombre que se desee asignar al espacio de trabajo.

source: **To add a new room:**
es: **Para agregar un nuevo espacio de trabajo:**

source: Right-click in the room tab area and choose New Room from the menu that opens.
es: Hacer clic derecho sobre una de las pestañas y escoger la opción *Nuevo espacio de trabajo* desde el menú.

source: **To delete a room:**
es: **Para borrar un espacio de trabajo:**

source: Right-click the room tab and choose Delete Room "<Name>" from the menu that opens. The current room cannot be deleted.
es: Hacer clic derecho sobre la pestaña del espacio de trabajo y escoger la opción *Borrar espacio de trabajo* "<nombre>" desde el menú. No es posible borrar el espacio de trabajo activo.

source: **To return to the set of rooms provided with Tahoma2D:**
es: **Para restablecer los espacios de trabajo predefinidos de Tahoma2D:**

source: Choose Panels → Reset to Default Rooms.
es: Elegir la opción Paneles → Restablecer espacios de trabajo.

source: Customizing Rooms
es: Personalización de los Espacios de trabajo

source: Rooms can be modified by setting different sizes to different panels. When "Room Editing Mode" is active, docked panels can be pulled out to become floating panels and floating panels can be docked.
es: Los espacios de trabajo pueden ser modificados, cambiando el tamaño de sus distintos paneles. Cuando el botón "Bloquear espacios de trabajo" se encuentre inactivo (candado abierto), los paneles empotrados podrán ser arrastrados para quedar flotantes y luego empotrarlos en otra parte del espacio de trabajo.

source: While "Room Editing Mode" is locked, panels can be resized and new floating panels can be added by using the Panels menu.
es: Cuando el botón "Bloquear espacios de trabajo" se encuentre activo (candado cerrado), los paneles igualmente podrán ser redimensionados y nuevos paneles flotantes podrán ser agregados, usando el menú Paneles.

source: **To resize a panel in the room:**
es: **Para redimensionar un panel del espacio de trabajo:**

source: Click any vertical or horizontal separator and drag it to the new position.
es: Hacer clic sobre un separador vertical u horizontal y arrastrarlo hacia la nueva posición.

source: Some panels like the toolbar have a fixed width or height, therefore they cannot always be resized.
es: Algunos paneles, como la Barra de herramientas tienen un tamaño fijo, por lo tanto no es posible modificarlos.

source: **To open a panel as a floating panel:**
es: **Para abrir un panel flotante:**

source: Select in the Panels menu the panel you want to open.
es: Seleccionar en el menú Paneles el panel que se desea abrir.

source: **To resize a floating panel:**
es: **Para redimensionar un panel flotante:**

source: Click and drag the border or corner of a panel.
es: Hacer clic y arrastrar el borde o la esquina del panel.

source: **To close a floating panel or a dialog:**
es: **Para cerrar un panel flotante o un diálogo:**

source: Click the close button at the right of the title bar.
es: Hacer clic en el botón de cerrar, del lado derecho de la barra de título.

source: **To add a panel to a room:**
es: **Para agregar un panel a un espacio de trabajo:**

source: Use the Panels menu to open the panel as a floating panel.
es: Usar el menú Paneles para abrir el panel como un panel flotante.

source: Click and drag its title bar to move it around and release to dock it according to the highlighted insertion point.
es: Hacer clic y arrastrar su barra de título para moverlo y soltarlo de forma que quede empotrado de acuerdo al punto de inserción resaltado.

source: Trying to dock a panel to the leftmost/rightmost part of the interface may fail if the main Tahoma2D window is maximized at that moment. To overcome this, you can restore the main window size, dock the desired panel, and then maximize it back.
es: Es posible encontrar dificultades al intentar empotrar un panel en los extremos laterales de la interfaz, en caso de que la ventana principal de Tahoma2D se encuentra maximizada en ese momento. Para solucionar esto, quitar la maximización de dicha ventana, encastrar el panel deseado y luego restaurar la maximización.

source: **To remove a panel from a room:**
es: **Para eliminar un panel de un espacio de trabajo:**

source: Click and drag the title bar of the panel you want to remove to undock it from the room.
es: Hacer clic y arrastrar la barra de título del panel que se desea eliminar, para dejarlo flotando como una ventana.

source: Close the floating panel.
es: Cerrar el panel flotante.

source: **To maximize, or minimize a panel:**
es: **Para maximizar o minimizar un panel:**

source: Double-click its title bar (for floating panels, the Viewer and the ComboViewer). If there is no title bar, press **`**.
es: Hacer doble clic en su barra de título (paneles flotante, Visor y Visor compuesto). En caso de que no se mostrara la barra de título, pulsar **`**.

source: Some panels like the toolbar and the command bar have a fixed size in one dimension, therefore they cannot be maximized.
es: Algunos paneles, como la Barra de herramientas tienen un tamaño fijo, por lo tanto no pueden ser maximizados.

source: Room Panels
es: Lista de paneles

source: Below there is a list of the panels (in the same order in which they appear in the Panels menu) that can be used to build rooms and that can be opened as floating panels.
es: Debajo hay una lista de los paneles (en el mismo orden en el que aparecen en el menú Paneles) que pueden ser usados en la creación de espacios de trabajo y que pueden ser abiertos como paneles flotantes.

source: Batch Servers
es: Servidores de tareas

source: The Batch Servers panel allows you to process the batch list by using the render farm, and contains information about the list of server (rendering) nodes defined for the farm.
es: El panel Servidores de tareas permite procesar una lista de tareas usando la granja de procesamiento, también contiene información acerca de la lista de los nodos servidores (de procesamiento) definidos para la granja.

source: See :ref:`Monitoring the Server Nodes <monitoring_the_server_nodes>` .
es: Ver :ref:`Monitoreo de nodos servidores <monitoring_the_server_nodes>` .

source: Cleanup Settings
es: Opciones de limpieza

source: The Cleanup Settings panel allows you to define the parameters for the clean-up process of scanned raster images, in order to convert them into Smart Raster images, ready to be painted in Tahoma2D.
es: El panel Opciones de limpieza permite definir los parámetros para el proceso de limpieza de imágenes escaneadas, de manera de convertirlas en niveles de Imagen inteligente, listos para ser pintados en Tahoma2D.

source: See :ref:`Cleaning-up Scanned Drawings <cleaning-up_scanned_drawings>` .
es: Ver :ref:`Limpieza de dibujos escaneados <cleaning-up_scanned_drawings>` .

source: Color Model
es: Modelo de color

source: The color model viewer displays the image, or animation level, you loaded as reference to paint the current animation level.
es: El visor de modelo de color muestra la imagen o nivel de animación que ha sido cargado como una referenca para ayudar en el proceso de pintado del nivel de animación actual.

source: See :ref:`Using a Color Model <using_a_color_model>` .
es: Ver :ref:`Uso del Modelo de color <using_a_color_model>` .

source: File Browser
es: Explorador de archivos

source: The file browser allows you to load and save files, and to access projects.
es: El explorador de archivos permite cargar y guardar archivos, así como acceder a los diferentes proyectos existentes.

source: On the left there is a file tree with some main folders containing material stored on your computer: My Computer, Network, My Documents, History, Library and Projects. You can open folders and sub-folders in order to retrieve files that are displayed in the area on the right.
es: Sobre la izquierda hay un árbol de carpetas mostrando las carpetas principales que contienen el material almacenado en el equipo: My Computer (Este equipo), Network (Red), My Documents (Documentos), History (Historial), Library (Biblioteca) y Project root (Carpeta de proyectos). Es posible abrir carpetas y subcarpetas para tener acceso a archivos, que serán mostrados en el área de la derecha.

source: See :ref:`Managing Projects <managing_projects>` and :ref:`Using the File Browser <using_the_file_browser>` .
es: Ver :ref:`Administración de proyectos <managing_projects>` y :ref:`Uso del Explorador de archivos <using_the_file_browser>` .

source: Flipbook
es: Reproductor

source: The flipbook can display animation levels, clips or sequences of images. It can be used to check levels for instance before loading them, or to control a rendered sequence.
es: El reproductor es capaz de mostrar los niveles de animación, clips de video o secuencias de imágenes. Puede ser usado, por ejemplo, para comprobar los niveles antes de cargarlos o para revisar una secuencia que acaba de ser procesada.

source: See :ref:`Using the Flipbook <using_the_flipbook>` .
es: Ver :ref:`Uso del Reproductor <using_the_flipbook>` .

source: Function Editor
es: Editor de funciones

source: The function editor maps objects and FX transformations with key values and related interpolations by using a spreadsheet or a graph editor. It is divided into two sections: on the left there is an area where the spreadsheet or graph editor is displayed, on the right top is an area where the interpolation of the current transformation segment is displayed, and on the right bottom is the objects/FX tree.
es: El Editor de funciones muestra la variación de las transformaciones de los objetos y de los efectos, permitiendo controlar sus fotogramas clave e interpolaciones por medio de una Planilla de tiempos o un Editor de gráficas. Se encuentra dividido en dos secciones: a la izquierda hay un área donde se muestra la Planilla de tiempos o el Editor de gráficas, en la sección superior-derecha un área donde se puede controlar la interpolación del segmento actual de animación, y en la sección inferior-derecha se encuentra el árbol de objetos/efectos.

source: See :ref:`Using the Function Editor <using_the_function_editor>` .
es: Ver :ref:`Uso del Editor de funciones <using_the_function_editor>` .

source: Level Strip
es: Cinta de nivel

source: The level strip displays the sequence of drawings belonging to the level currently selected in the Xsheet.
es: La Cinta de nivel muestra la secuencia de dibujos pertenecientes al nivel actualmente seleccionado en la Planilla o la Línea de tiempo.

source: It helps you to edit the sequence of drawings and to see all the drawings of the current level, even if those drawings are not exposed in a Xsheet.
es: Ayuda a editar la secuencia de dibujos y permite ver todos los dibujos del nivel actual, aunque no se encuentren expuestos en una Planilla/Línea de tiempo.

source: See :ref:`Editing Animation Levels <editing_animation_levels>` .
es: Ver :ref:`Edición de niveles de animación <editing_animation_levels>` .

source: Palette
es: Paleta

source: It displays the styles defined for the current level, or in case it is inactive the styles defined for a previously selected level.
es: Muestra los estilos definidos en el nivel actual o, en caso de encontrarse inactiva, los estilos de un nivel seleccionado con anterioridad.

source: See :ref:`The Palette Panel<the_palette_window>` .
es: Ver :ref:`El panel Paleta <the_palette_window>` .

source: Scene Cast
es: Componentes de la escena

source: The scene cast panel lets you control the files loaded in the scene, save them and load new ones. It can be organized in folders and sub-folders.
es: El panel Componentes de la escena permite controlar los archivos cargados en la escena, guardarlos y cargar nuevos. Puede ser organizado en carpetas y subcarpetas.

source: See :ref:`Using the Scene Cast <using_the_scene_cast>` .
es: Ver :ref:`Uso de Componentes de la escena <using_the_scene_cast>` .

source: Schematic
es: Diagrama

source: The schematic can alternatively display stage information or special FX usage.
es: El Diagrama puede mostrar de forma alternativa información de la escena o del uso de efectos especiales.

source: The stage schematic displays as nodes all the objects defined in a scene, i.e. columns, pegbars, cameras, the table and motion paths, and allows you to manage the way they are linked to each other.
es: El Diagrama de escenario muestra, en forma de nodos, todos los objetos definidos en la escena, p.ej: columnas, barras de sujeción, cámaras, la mesa, trayectorias de movimiento, y también permite administrar la forma en que éstos se vinculan entre sí.

source: The FX schematic allows you to apply FX to the content of Xsheet columns, and to manage the way they are applied. All the columns and FX are displayed as nodes that can be connected in order to set the way FX affect the scene content.
es: El Diagrama de efectos permite aplicar efectos al contenido de las columnas/capas de la Planilla/Línea de tiempo, y administrar la forma en que éstos se aplican. Todas las columnas/capas y los efectos se muestran como nodos que pueden ser conectados entre sí, de manera de definir la forma en la que los efectos afectarán al contenido de la escena.

source: See :ref:`Using the Stage Schematic <using_the_stage_schematic>` and :ref:`Using the FX Schematic <using_the_fx_schematic>` .
es: Ver :ref:`Uso del Diagrama de escenario <using_the_stage_schematic>` y :ref:`Uso del Diagrama de efectos <using_the_fx_schematic>` .

source: Studio Palette
es: Paleta de estudio

source: The studio palette allows you to store an unlimited number of level palettes. From here any palette can be retrieved and assigned to the current level in order to paint it, with no need to define the same styles again and again. It also includes a viewer displaying the styles of the currently selected palette.
es: La Paleta de estudio permite almacenar una cantidad ilimitada de paletas de nivel. Desde aquí es posible recuperar cualquier paleta y asignarla al nivel actual para pintarlo con sus colores, sin necesidad de volver a definir los mismos estilos una y otra vez. También incluye un visor para mostrar los estilos de la paleta seleccionada.

source: See :ref:`Using the Studio Palette <using_the_studio_palette>` .
es: Ver :ref:`Uso de la Paleta de estudio <using_the_studio_palette>` .

source: Style Editor
es: Editor de estilos

source: The style editor allows you to modify the palette styles. You can choose the type of style among color, texture, vector and raster. There also is a settings tab where you can decide some parameters for the style.
es: El Editor de estilos permite modificar los estilos de una paleta. Es posible escoger los tipos de estilos entre: color, texturas, vectoriales o pinceles. También contiene una pestaña de opciones donde será posible cambiar algunos parámetros para el estilo escogido.

source: See :ref:`Editing Styles <editing_styles>` .
es: Ver :ref:`Edición de estilos <editing_styles>` .

source: Tasks
es: Tareas

source: The Tasks panel contains the task tree with all the tasks submitted to the batch processing, and information about the task currently selected in the tree. From the task tree you can start or stop a task execution, or remove it.
es: La ventana de Tareas contiene el árbol de tareas con todas las tareas enviadas para ser procesadas, así como información acerca de la tarea actualmente seleccionada en el árbol. Desde el árbol de tareas es posible iniciar o detener la ejecución las mismas, así como eliminarlas.

source: See :ref:`Managing and Executing Render Tasks <managing_and_executing_render_tasks>` .
es: Ver :ref:`Administración y ejecución de tareas <managing_and_executing_render_tasks>` .

source: Message Center
es: Centro de mensajes

source: The message center displays in a list the messages Tahoma2D is sending to the user. You can set filters on the messages showed in the panel using the appropriate radio buttons, or you can clear completely the list pressing the Clear button.
es: El Centro de mensajes muestra una lista con los mensajes que Tahoma2D va enviando al usuario. Es posible filtrar los mensajes mostrados, usando las opciones para ese fin, también es posible limpiar la lista completamente usando el botón Limpiar.

source: Toolbar
es: Barra de herramientas

source: The toolbar contains tools to draw, select and edit drawings, and to animate objects like the camera, columns and pegbars. The tools in the toolbar can only be used in the main viewer.
es: La Barra de herramientas contiene herramientas para dibujar, seleccionar y editar dibujos, así como para animar objetos como cámaras, columnas/capas y barras de sujeción. Las herramientas presentes en la barra sólo pueden ser usadas en el visor principal.

source: If the toolbar is too short to display all the tools, it can be scrolled by using arrow buttons available at its ends.
es: Si la barra fuera muy corta como para mostrar todas las herramientas, es posible desplazarla usando los botones con flechas en sus extremos.

source: |animate| **Animate** modifies the position, rotation and size of the current objects (see :ref:`Animating Objects <animating_objects>` ).
es: |animate| **Animar** permite modificar la posición, rotación y escala del objeto actual (ver :ref:`Animación de objetos <animating_objects>` ).

source: |selection| **Selection** performs a selection and transforms it (see :ref:`Using the Selection Tool <using_the_selection_tool>` ).
es: |selection| **Seleccionar** permite seleccionar y transformar elementos de la escena (ver :ref:`Uso de herramienta Seleccionar <using_the_selection_tool>` ).

source: |brush| **Brush** draws in the work area in freehand mode (see :ref:`Drawing with the Brush Tool <drawing_with_the_brush_tool>` ).
es: |brush| **Pincel** permite dibujar a mano alzada (ver :ref:`Dibujo con la herramienta Pincel <drawing_with_the_brush_tool>` ).

source: |geometric| **Geometry** draws geometric shapes (see :ref:`Drawing with the Geometric Tool <drawing_with_the_geometric_tool>` ).
es: |geometric| **Geometría** permite dibujar figuras geométricas y crear curvas manualmente (ver :ref:`Dibujo con la herramienta Geometría <drawing_with_the_geometric_tool>` ).

source: |type| **Type** adds text by setting the font and size (see :ref:`Adding Text <adding_text>` ).
es: |type| **Texto** permite agregar texto, estableciendo el tipo de letra y tamaño (ver :ref:`Uso de Texto <adding_text>` ).

source: |fill| **Fill** fills drawing areas with the current style (see :ref:`Filling Areas <filling_areas>` ).
es: |fill| **Rellenar** permite rellenar áreas de un dibujo con el estilo actual (ver :ref:`Relleno de áreas <filling_areas>` ).

source: |paint_brush| **Smart Raster Paint** paints lines and areas in Smart Raster drawings in freehand mode. (see :ref:`Filling Areas <filling_areas>` ).
es: |paint_brush| **Brocha (imagen inteligente)** permite pintar líneas y áreas a mano alzada en niveles de Imagen inteligente. (ver :ref:`Relleno de áreas <filling_areas>` ).

source: |eraser| **Eraser** deletes vectors in vector drawings, and painted areas and lines in raster drawings (see :ref:`Drawing Tools <drawing_tools>` ).
es: |eraser| **Borrador** permite borrar trazos vectoriales, así como líneas y áreas pintadas en todo tipo de niveles (ver :ref:`Herramientas de dibujo <drawing_tools>` ).

source: |tape| **Tape** joins two open ends of one or two vectors in vector drawings, or closes gaps in raster drawings (see :ref:`Joining and Splitting <joining_and_splitting>` ).
es: |tape| **Cinta** permite unir dos extremos abiertos de uno o dos trazos vectoriales, o cerrar huecos en niveles de imagen (ver :ref:`Unión y división <joining_and_splitting>` ).

source: |style_picker| **Style Picker** picks a style from the current drawing, that becomes the current style in the palette and in the style editor.
es: |style_picker| **Selector de estilos** permite escoger un estilo desde el nivel actual, que se convertirá en el estilo actual en la Paleta y en el Editor de estilos.

source: |RGB_picker| **RGB Picker** picks red, green and blue values from the viewer content, and applies them to the current style (see :ref:`Plain Colors <plain_colors>` ).
es: |RGB_picker| **Selector de color** permite escoger valores de color desde el visor y lo aplica al estilo actual (ver :ref:`Colores plenos <plain_colors>` ).
