Repository: tahoma2d/tahoma2d_docs
Catalog: source/locale/*/LC_MESSAGES/interface_overview.po
Languages: es

source: |cpe| **Control Point Editor** modifies the vector shape by editing its control points (see :ref:`Editing Vector Control Points <editing_vector_control_points>` ).
es: |cpe| **Editar puntos de control** permite modificar trazos vectoriales, editando sus puntos de control (ver :ref:`Edición de puntos de control <editing_vector_control_points>` ).

source: |pinch| **Pinch** modifies the vector shape by clicking and dragging anywhere on the vector (see :ref:`Changing the Bend of Vectors <changing_the_bend_of_vectors>` ).
es: |pinch| **Pellizcar** permite modificar la forma de un trazo vectorial, haciendo clic y arrastrando sobre el mismo (ver :ref:`Cambio de curvatura de trazos vectoriales <changing_the_bend_of_vectors>` ).

source: |pump| **Pump** locally modifies the vector thickness by clicking on the section you want to affect and then dragging up or down (see :ref:`Using Other Modifier Tools <using_other_modifier_tools>` ).
es: |pump| **Inflar** permite modificar localmente el grosor en trazos vectoriales, haciendo clic en la sección que se desea afectar y arrastrando hacia arriba o abajo (ver :ref:`Uso de otras herramientas de modificación <using_other_modifier_tools>` ).

source: |magnet| **Magnet** deforms several vectors at once by clicking the area you want to affect and dragging (see :ref:`Using Other Modifier Tools <using_other_modifier_tools>` ).
es: |magnet| **Imantar** permite deformar varios trazos vectoriales al mismo tiempo, haciendo clic en el área que se desea afectar y arrastrando (ver :ref:`Uso de otras herramientas de modificación <using_other_modifier_tools>` ).

source: |bender| **Bender** bends vectors in vector drawings (see :ref:`Using Other Modifier Tools <using_other_modifier_tools>` ).
es: |bender| **Doblar** permite doblar trazos vectoriales (ver :ref:`Uso de otras herramientas de modificación <using_other_modifier_tools>` ).

source: |iron| **Iron** removes creases from vectors by moving the cursor on the vector you want to flatten (see :ref:`Using Other Modifier Tools <using_other_modifier_tools>` ).
es: |iron| **Planchar** elimina pliegues en trazos vectoriales, arrastrando el cursor sobre el trazo que se desea aplanar (ver :ref:`Uso de otras herramientas de modificación <using_other_modifier_tools>` ).

source: |cutter| **Cutter** splits a vector in two sections when clicking on it (see :ref:`Joining and Splitting <joining_and_splitting>` ).
es: |cutter| **Cortar** permite dividir un trazo vectorial en dos secciones, al hacer clic sobre el mismo (ver :ref:`Unión y división <joining_and_splitting>` ).

source: |skeleton| **Skeleton** defines character models, and animates them as in cutout animation (see :ref:`Using the Skeleton Tool <using_the_skeleton_tool>` )
es: |skeleton| **Esqueleto** permite definir modelos de personajes y animarlos como si fuera una animación de recortes (ver :ref:`Uso de la herramienta Esqueleto <using_the_skeleton_tool>` )

source: |tracker| **Tracker** tracks specific regions in a sequence of images (see :ref:`Tracking Points <tracking_points>` ).
es: |tracker| **Punto de rastreo** permite rastrear regiones específicas en una secuencia de imágenes (ver :ref:`Rastreo de puntos <tracking_points>` ).

source: |hook| **Hook** defines reference points to be used in the stage schematic to move an object, or link one object to another (see :ref:`Using Hooks <using_hooks>` ).
es: |hook| **Enganche** permite definir puntos de referencia para ser usados en el Diagrama de escenario para mover objetos o vincular objetos entre sí (ver :ref:`Uso de Enganches <using_hooks>` ).

source: |plastic| **Plastic** builds a mesh that allows to deform and animate a character or part of it (see :ref:`Using Plastic tool <using_plastic_tool>` ).
es: |plastic| **Plástico** permite construir una malla poligonal para deformar y animar un personaje completo o una parte de él (ver :ref:`Uso de la herramienta Plastico <using_plastic_tool>` ).

source: |zoom| **Zoom** zooms in and out the viewer content; after you click you can drag up to zoom in the work area, or drag down to zoom out.
es: |zoom| **Ampliar** permite ampliar o reducir el contenido del visor, arrastrando hacia arriba para ampliar o hacia abajo para reducir.

source: |rotate| **Rotate** rotates the viewer content; if the 3D view is activated, the Rotate tool lets you change the point of view.
es: |rotate| **Rotar** permite rotar el contenido del visor; cuando se encuentra activa la vista 3D, permite cambiar el punto de vista.

source: |hand| **Hand** pans over the viewer content; if the 3D view is activated, the Hand tool lets you pan over the 3D view as well.
es: |hand| **Desplazar** permite desplazar el contenido del visor; cuando se encuentra activa la vista 3D, también permite desplazamientos en 3D.

source: Tool Options Bar
es: Barra de opciones de herramientas

source: The tool options bar displays settings for the current tool, if it has any.
es: La barra de opciones de herramientas muestra las opciones de la herramienta actual, si es que hubiera una activa.

source: For example it lets you set the thickness and other properties of the Brush tool.
es: Por ejemplo, permite definir el Tamaño y otras propiedades en la herramienta Pincel.

source: If the tool options bar is too short to display all the tool options, it can be scrolled by using arrow buttons available at its ends.
es: Si la barra de opciones de herramientas fuera muy corta como para mostrar todas las opciones, es posible desplazarla usando los botones con flechas en los extremos de la misma.

source: Command Bar
es: Barra de comandos

source: The Command Bar is a place where the user can display favorite Tahoma2D tools and commands to have them readily available.
es: La Barra de comandos es un lugar en donde el usuario puede colocar sus herramientas y comandos favoritos de Tahoma2D, para tenerlos rápidamente a su disposición en la interfaz.

source: The Command Bar panel can be docked in any part of the Tahoma2D UI.
es: El panel de la Barra de comandos puede ser encastrado en cualquier parte de la interfaz de Tahoma2D.

source: If the Command Bar is too short to display all the command buttons, a double-arrow symbol will appear at the right end of it, allowing to display a drop down menu with the rest of them.
es: Si la Barra de comandos fuera muy corta como para mostrar todos los botones allí presentes, aparecerá un símbolo con una doble flecha en su extremo derecho, para permitir mostrar las opciones restantes en forma de menú desplegable.

source: **To display the Command Bar:**
es: **Para mostrar la Barra de comandos:**

source: Choose Panels → Command Bar.
es: Elegir Paneles → Barra de comandos.

source: **To customize the Command Bar buttons:**
es: **Para personalizar los botones de la Barra de comandos:**

source: Choose Panels → Command Bar to open the Command Bar.
es: Elegir Paneles → Barra de comandos, para abrir la Barra de comandos.

source: Right click on it and select **Customize Command Bar** from the menu that opens. The Customize Command Bar panel will open.
es: Hacer clic derecho sobre ella y seleccionar **Personalizar barra de comandos** del menú. Se abrirá la ventana Personalizar barra de comandos.

source: To *add* a command: Search for a command in the **Commands** list (left) and drag it to the **Command Bar** list (right).
es: Para *agregar* un comando: Buscar un comando en la lista **Elementos de la barra de herramientas** (izquierda) y arrastrarlo a la lista **Barra de comandos** (derecha).

source: To *add* a separator: At the end of the **Commands** list (left), drag the **----Separator----** item to the **Command Bar** list (right).
es: Para *agregar* un separador: Al final de la lista **Elementos de la barra de herramientas** (izquierda), arrastrar el elemento **----Separador----** hacia la lista **Barra de comandos** (derecha).

source: To *delete* a command: Locate the command in the **Command Bar** list (right), right click on it and select **Remove** from the menu that opens.
es: Para *borrar* un comando: Ubicar el comando en la lista **Barra de comandos** (derecha), hacer clic derecho sobre él y seleccionar **Eliminar** del menú.

source: Click **OK** to accept the changes or **Cancel** to discard them.
es: Hacer clic en **Aceptar** para aceptar los cambios o en **Cancelar** para descartarlos.

source: Viewer
es: Visor

source: The viewer is the work area where you can draw images and see at the same time the result of your compositing. It is endless and you can scroll, zoom in, zoom out and rotate it the way you prefer.
es: El Visor es el área de trabajo donde es posible dibujar imágenes y ver, al mismo tiempo, el resultado de la composición. Es infinito y es posible desplazarlo, acercarlo, alejarlo y rotarlo en la manera más conveniente.

source: It has different modes of visualization among which you can choose the more suitable to the operation you are performing.
es: Presenta varios modos distintos de visualización entre los que es posible elegir el más adecuado para las distintas operaciones que se estén realizando.

source: See :ref:`Using the Viewer <using_the_work_area>` and :ref:`Previewing the Animation <previewing_the_animation>` .
es: Ver :ref:`Uso del visor <using_the_work_area>` y :ref:`Previsualización de animaciones <previewing_the_animation>` .

source: ComboViewer
es: Visor compuesto

source: The comboviewer integrates in a single panel a viewer, horizontal toolbar and a tool options bar. It's and alternative work area where you can draw images and see at the same time the result of your compositing. It is endless and you can scroll, zoom in, zoom out and rotate it the way you prefer.
es: El Visor compuesto integra en un solo panel un visor, una barra de herramientas horizontal y una barra de opciones de herramientas. Es un área alternativa de trabajo, donde es posible dibujar imágenes y ver, al mismo tiempo, el resultado de la composición. Es infinito y es posible desplazarlo, ampliarlo, reducirlo y rotarlo en la manera más conveniente.

source: Xsheet
es: Planilla

source: The Xsheet allows you to manage the scene content, in the same manner as the timeline. It is organized in columns, and columns are divided into cells, representing the content of that column in that particular frame. In the columns you can load animation levels, clips, images, audio files or other Xsheets.
es: La Planilla permite administrar el contenido de la escena, del mismo modo que la Línea de tiempo. Se encuentra organizada en columnas, y éstas a su vez están divididas en celdas que representan al contenido de dicha columna en un fotograma determinado. En las columnas es posible cargar niveles de animación, clips de video, imágenes, archivos de sonido y otras Planillas.

source: Each column has its own header containing information about its content. The column on the far left displays the frame number, with a cursor placed on the current frame. The headers area and the frame column are always visible, even when scrolling the Xsheet area; in this way it's easier to understand how the scene is built.
es: Cada columna tiene su propio encabezado que contiene información acerca de su contenido. La columna del extremo izquierdo muestra los números de fotograma, con un cursor indicando el fotograma actual. El área del encabezado y la columna de fotogramas siempre se encuentran visibles, aún cuando se desplaza el área de la Planilla; de esta forma resulta sencillo entender cómo está creada la escena.

source: Frames are rendered reading images from left to right in each cell row.
es: Los fotogramas son procesados leyendo las imágenes desde la izquierda hacia la derecha de cada fila de celdas, encontrándose las de la izquierda por detrás de las de la derecha.

source: See :ref:`Working in Xsheet <working_in_xsheet>` .
es: Ver :ref:`Trabajo en la Planilla <working_in_xsheet>` .

source: Timeline
es: Línea de tiempo

source: The timeline allows you to manage the scene content, in the same manner as the Xsheet. It is organized in horizontal layers, and layers are divided into cells, representing the content of that layer in that particular frame. In the layers you can load animation levels, clips, images, audio files or other timelines.
es: La Línea de tiempo permite administrar el contenido de la escena, del mismo modo que la Planilla. Se encuentra organizada en capas, y éstas a su vez están divididas en celdas que representan al contenido de dicha capa en un fotograma determinado. En las capas es posible cargar niveles de animación, clips de video, imágenes, archivos de sonido y otras Líneas de tiempo.

source: At the leftmost part each layer has its own header containing information about its content. At the top part of the timeline there is a time ruler that displays the frame number, with a cursor placed on the current frame. The headers area and the time ruler are always visible, even when scrolling the timeline area; in this way it's easier to understand how the scene is built.
es: En el extremo izquierdo, cada capa tiene su propio encabezado que contiene información acerca de su contenido. La barra superior muestra los números de fotograma, con un cursor indicando el fotograma actual. El área del encabezado y la barra de fotogramas siempre se encuentran visibles, aún cuando se desplaza el área de la Línea de tiempo; de esta forma resulta sencillo entender cómo está creada la escena.

source: Frames are rendered reading images from bottom to top in each cell column.
es: Los fotogramas son procesados leyendo las imágenes desde abajo hacia arriba de cada columna de celdas, encontrándose las de más abajo por detrás de las de arriba.

source: History
es: Historia

source: The history panel, lets you check and undo/redo the history of the latest actions performed in the current Tahoma2D scene.
es: El panel Historia permite comprobar la historia y deshacer/rehacer las acciones más recientes realizadas en la escena actual de Tahoma2D.

source: See :ref:`Assigning Memory for the Undo Operation <assigning_memory_for_the_undo_operations>` .
es: Ver :ref:`Asignación de memoria para la función Deshacer <assigning_memory_for_the_undo_operations>` .

source: Record Audio
es: Grabación de sonido

source: The record audio panel, lets you record a live audio source, listen to it, and insert it into a new audio column of the Xsheet. The insertion point will be located at the right of the selected cell column, and starting at the selected cell frame.
es: La ventana Grabación de sonido permite grabar una fuente de audio en vivo, escucharla e insertarla en una nueva columna/capa de sonido en la Planilla/Línea de tiempo. El punto de inserción estará ubicado a la derecha de la columna (o arriba de la capa) correspondiente a la celda seleccionada, comenzando en el fotograma actual.

source: Currently, this panel cannot be docked to form part of a room, like the other ones in the Panels menu. Instead it must be opened as a floating panel, when needed.
es: Actualmente esta no es posible empotrar esta ventana para formar parte de un espacio de trabajo, tal como sucede con otros paneles del menú Paneles. Deberá ser abierta como una ventana flotante, cuando sea necesario su uso.

source: Customizing the Interface Appearance
es: Personalización de la apariencia de la interfaz

source: The appearance of the Tahoma2D interface can be customized to suit any production need by choosing a specific language and interface theme.
es: La apariencia de la interfaz de Tahoma2D puede ser personalizada para adecuarse a cualquier necesidad de una producción, escogiendo un idioma y tema de interfaz.

source: Tahoma2D allows users to choose a specific language for the software interface, including menus, commands, tooltips, and on-screen messages. Currently available languages are: English, German, Spanish, French, Italian, Czech, Russian, Chinese, Japanese and Korean.
es: Tahoma2D permite al usuario escoger un idioma específico para su interfaz de usuario, incluyendo menúes, comandos, descripciones y mensajes en pantalla. Los idiomas disponibles actualmente son: Español, Inglés, Alemán, Francés, Italiano, Ruso, Japonés y Chino.

source: There are also several included themes to choose from: Dark, Darker, Light, Medium and Neutral.
es: También hay varios temas disponibles, entre los cuales elegir: Dark (Oscuro), Darker (Más oscuro), Light (Claro), Medium (Medio) y Neutral.

source: The Tahoma2D interface theme set to Dark and to Light.
es: El tema de la interfaz de Tahoma2D establecido en Predefinido y Claro.

source: The interface themes are defined by means of a QSS file, whose concepts, terminology, and syntax are inspired by CSS files (HTML Cascading Style Sheets). The QSS files also refers to a set of PNG images that are used to create interface widgets.
es: Los temas de la interfaz se encuentran definidos a través de un archivo QSS, cuyos conceptos, terminología y sintaxis están inspirados en los archivos CSS (hojas de estilo en cascada de HTML). Los archivos QSS también hacen referencia a imágenes PNG que son usadas para crear los controles de la interfaz.

source: These files are stored in a folder named as the QSS file, and located in the ``C:\Tahoma stuff\config\qss`` folder on Windows and ``Tahoma stuff\config\qss`` folder on Macintosh.
es: Estos archivos son almacenados en una carpeta nombrada de igual forma que el archivo QSS y ubicados en la carpeta ``C:\Tahoma stuff\config\qss`` en Windows y en la carpeta ``Tahoma stuff\config\qss`` en macOS.

source: The QSS file for Macintosh is named with the _mac suffix.
es: El nombre del archivo QSS en macOS contiene el sufijo _mac.

source: The QSS file can be edited with any text editor software, e.g. Notepad or TextEdit; the PNG images with any image editor software. Editing the QSS file requires some skill in CSS language, but some changes like colors of panel elements, can be easily done by expressing them with red, green and blue values.
es: El archivo QSS puede ser editado con cualquier editor de texto, p.ej: Bloc de notas o TextEdit; las imágenes PNG con cualquier editor de imágenes. Editar el archivo QSS requiere, sin embargo, de algunas destrezas en el lenguaje CSS; igualmente algunos cambios como colores de los elementos de los paneles pueden ser realizados de forma sencilla, expresándolos como valores de rojo, verde y azul.

source: The QSS files defining the colors and the images used in the Tahoma2D interface have to be written according to a specific syntax, otherwise Tahoma2D interface will not be displayed properly. If you decide to edit a QSS file, make a backup copy first in case you need to revert the file to the original version.
es: Los archivos QSS que definen los colores e imágenes usadas en la interfaz de Tahoma2D tienen que ser escritos de acuerdo a una sintaxis específica, de otro modo la interfaz de Tahoma2D no será mostrada adecuadamente. Si se va a editar uno de estos archivos, hacer ante un respaldo, en caso de que sea necesario volver a la versión original.

source: **To choose the interface language:**
es: **Para elegir el idioma de la interfaz:**

source: Choose File → Preferences → Interface.
es: Elegir Archivo → Preferencias > Interfaz.

source: In the Language* option menu choose the language you want to use in the interface.
es: En el menú **Idioma:** elegir el idioma deseado.

source: Restart Tahoma2D to have the interface in the selected language.
es: Reiniciar Tahoma2D para ver la interfaz en el idioma seleccionado.

source: **To choose the interface theme:**
es: **Para elegir el tema de la interfaz:**

source: In the Theme option menu choose the style to be applied to the interface.
es: En el menú **Tema:** elegir el tema a aplicar a la interfaz.

source: **To create a new theme:**
es: **Para crear un nuevo tema:**

source: Navigate to ``C:\Tahoma stuff\config\qss`` folder on Windows and ``Tahoma stuff\config\qss`` folder on Macintosh.
es: Navegar hasta la carpeta ``C:\Tahoma stuff\config\qss`` en Windows o la carpeta ``Tahoma stuff\config\qss`` en Macintosh.

source: Duplicate one of the already existing style folder.
es: Duplicar una de las carpetas de tema ya existentes.

source: Rename the folder and the QSS files inside it with the name you want to assign to the style.
es: Renombrar la carpeta y los archivos QSS dentro de ésta con el nombre que se desea asignar al nuevo tema.

source: Edit the QSS file and the PNG images contained in the new folder.
es: Editar el archivo QSS y las imágenes PNG contenidos en la nueva carpeta.

source: The new style will be available in the Preferences dialog the next time you run Tahoma2D.
es: El nuevo tema estará disponible en el diálogo de **Preferencias** la próxima vez que se ejecute Tahoma2D.

source: **To edit style QSS file:**
es: **Para editar un archivo de estilo QSS:**

source: Open and edit with a text editor software (e.g. Notepad or TextEdit) the QSS files available in the style folder.
es: Abrir y editar con un editor de texto (p.ej: Bloc de notas o TextEdit) los archivos QSS disponibles en la carpeta del tema.

source: **To edit style images:**
es: **Para editar las imágenes del estilo:**

source: Open and edit with an image editor software the PNG files available in the style folder.
es: Abrir y editar con un editor de imágenes los archivos PNG disponibles en la carpeta del tema.
