Repository: tahoma2d/tahoma2d_docs
Catalog: source/locale/*/LC_MESSAGES/troubleshooting.po
Languages: es

source: Troubleshooting
es: Solución de problemas

source: Below is a list of potential problems with each operating system and how to fix them.
es: Debajo se presenta una lista de potenciales problemas con cada sistema operativo y cómo solucionarlos.

source: If you encounter a problem that is not mentioned below, please `submit an issue on GitHub <https://github.com/tahoma2d/tahoma2d/issues/new?assignees=&labels=bug&template=bug_report.md&title=>`_ so that the developers can work on the problem and others can help you with a solution.
es: En caso de encontrar un problema que no esté mencionado debajo, por favor `abrir un incidente al respecto en GitHub <https://github.com/tahoma2d/tahoma2d/issues/new?assignees=&labels=bug&template=bug_report.md&title=>`_ para que los desarrolladores puedan trabajar en él y otros usuarios puedan potencialmente ayudar con alguna solución.

source: If you have a solution to a problem that is not listed below, we appreciate your help in improving this section by clicking the *Edit on GitHub* button at the top of this page.
es: En caso de tener la solución a algún problema que no se encuentre listado debajo, apreciaríamos la ayuda para mejorar esta sección, haciendo clic en el botón *Edit on GitHub* en la parte superior de esta página.

source: Problem
es: Problema

source: Cause
es: Causa

source: Solution
es: Solución

source: The code execution cannot proceed because MSVCP140.dll was not found. Reinstalling the program may fix the issue
es: La ejecución del programa no puede continuar porque la biblioteca MSVCP140.dll no fue encontrada. Reinstalar el programa podría solucionar este problema

source: Newer systems no longer ship with these DLLs
es: Los sistemas más nuevos ya no vienen con estas bibliotecas DLL

source: Download and install the `Microsoft Visual C++ 2015 Redistributable Update 3 RC <https://www.microsoft.com/en-us/download/details.aspx?id=52685>`_.
es: Descargar e instalar el paquete `Microsoft Visual C++ 2015 Redistributable Update 3 RC <https://www.microsoft.com/en-us/download/details.aspx?id=52685>`_.

source: The code execution cannot proceed because VCRUNTIME140.dll was not found. Reinstalling the program may fix the issue
es: La ejecución del programa no puede continuar porque la biblioteca VCRUNTIME140.dll no fue encontrada. Reinstalar el programa podría solucionar este problema

source: The code execution cannot proceed because Qt*.dll was not found. Reinstalling the program may fix the issue
es: La ejecución del programa no puede continuar porque la biblioteca Qt*.dll no fue encontrada. Reinstalar el programa podría solucionar este problema

source: You did not unzip the Tahoma2D-win.zip but tried to run it from within the zip'd folder instead
es: No se extrajo el archivo Tahoma2D-portable-win.zip, sino que se ejecutó el programa desde dentro mismo del archivo comprimido zip

source: Uncompress the Tahoma2D-win.zip to create the Tahoma2D folder
es: Descomprimir el archivo Tahoma2D-portable-win.zip para crear la carpeta Tahoma2D

source: You moved the Tahoma2D.exe out of the Tahoma2D folder and away from the tahomastuff folder
es: Se movió el archivo Tahoma2D.exe fuera de la carpeta Tahoma2D y lejos de la carpeta tahomastuff

source: Move the Tahoma2d.exe back to the Tahoma2D folder so it's in the same directory as the tahomastuff folder
es: Mover el archivo Tahoma2d.exe de vuelta a la carpeta Tahoma2D para que esté en la misma carpeta que la carpeta tahomastuff

source: Undefined or empty: "SOFTWARE\\Tahoma2D\\Tahoma2D\\TAHOMA2DROOT" Installing Tahoma2D 1.x again could fix the problem.
es: "SOFTWARE\\Tahoma2D\\Tahoma2D\\TAHOMA2DROOT" no definido o vacío. Instalar nuevamente Tahoma2D 1.x podría solucionar el problema.

source: If the directory path to Tahoma2D contains your username, certain special characters in your username may cause the path to the tahomastuff folder to not be found
es: En caso de que la ruta a la carpeta Tahoma2D contuviera el nombre de usuario, ciertos caracteres especiales en dicho nombre podrían causar que la ruta hasta la carpeta tahomastuff no fuera correctamente interpretada

source: Move the entire Tahoma2D folder to a directory whose path does not contain your username, like C:\\ or C:\\Program Files
es: Mover la carpeta Tahoma2D hacia una carpeta cuya ruta no contenga caracteres especiales, tal como C:\\ o C:\\Archivos de programa

source: The Tahoma2D splash screen shows then disappears but never opens
es: La imagen de inicio de Tahoma2D es mostrada, luego desaparece, pero el programa nunca arranca

source: Anti-virus software may be blocking it
es: Un programa antivirus podría estar bloqueándolo

source: Temporarily disable anti-virus software and attempt to start again. If it starts normally, then add Tahoma2d.exe as an exception in your anti-virus
es: Deshabilitar temporalmente el antivirus e intentar iniciar nuevamente el programa. Si se ejecutara normalmente, se deberá agregar una excepción para Tahoma2d.exe en el antivirus

source: The tahomastuff folder does not have the proper permissions
es: La carpeta tahomastuff no tiene los permisos adecuados

source: Right-click the Tahoma2D\\tahomastuff folder, select Properties, click on the Security tab and make sure your username exists in the list and has full permissions. If not found, add it. Alternatively, run Tahoma2D.exe as Administrator
es: Hacer clic derecho sobre la carpeta Tahoma2D\\tahomastuff, seleccionar Propiedades, hacer clic en la pestaña Seguridad y asegurarse de que el nombre del usuario que está siendo usado exista en la lista y tenga permisos completos sobre la carpeta. En caso de no estar, agregarlo. Alternativamente, ejecutar Tahoma2D.exe como Administrador

source: Unknown
es: Desconocida

source: Open Window's Event Viewer, click Windows Logs, click on Application. Look for an Error log for Tahoma2D and see what it says. If you are not sure what it means or how to resolve it, open an issue here: https://github.com/tahoma2d/tahoma2d/issues
es: Abrir el Visor de eventos de Windows, hacer clic en Registros de Windows, luego hacer clic en Aplicación. Buscar un registro de Error de Tahoma2D y ver lo que dice. En caso de no estar seguro de su significado o de cómo resolverlo, abrir un incidente aquí: https://github.com/tahoma2d/tahoma2d/issues

source: Undefined or empty: "SOFTWARE\\Tahoma2D\\Tahoma2D\\TAHOMA2DROOT" Installing Tahoma2D 1.x again could Solution the problem.
es: "SOFTWARE\\Tahoma2D\\Tahoma2D\\TAHOMA2DROOT" no definido o vacío. Instalar nuevamente Tahoma2D 1.x podría solucionar el problema.

source: You moved the Tahoma2D.app out of the Tahoma2D folder and away from the tahomastuff folder
es: Se movió Tahoma2D.app fuera de la carpeta Tahoma2D y lejos de la carpeta tahomastuff

source: Move the Tahoma2d.AppImage back to the Tahoma2D folder so it's in the same directory as the tahomastuff folder
es: Mover Tahoma2d.AppImage de nuevo a la carpeta Tahoma2D, para que esté en la misma carpeta que la carpeta tahomastuff

source: Move the entire Tahoma2D folder to a directory whose path does not contain your username, like /usr/local/bin or some appropriate directory.
es: Mover la carpeta Tahoma2D hacia una carpeta cuya ruta no contenga caracteres especiales, tal como /usr/local/bin o algún otro directorio apropiado.
