Repository: tahoma2d/tahoma2d_docs
Catalog: source/locale/*/LC_MESSAGES/using_the_particles_effect.po
Languages: es

source: Using the Particles Effect
es: Uso del efecto Partículas

source: The Particles effect creates a new level in the selected column/layer containing particles.
es: El efecto Partículas permite crear una nueva columna/capa conteniendo partículas.

source: It allows you to simulate a wide range of phenomena, such as rain, snow, sparkles, smoke, and a random configuration of elements, for example a field of shining stars starting from one shining star or the waving grass in a meadow starting from one animated blade of grass.
es: Es capaz de simular una amplia variedad de fenómenos, como lluvia, nieve, chispas, humo, así como también de habilitar la creación de múltiples elementos, por ejemplo la creación de todo un cielo de estrellas a partir de una sola de ellas o de un campo de césped a partir del dibujo de un solo tallo animado.

source: Using a wide variety of parameters available, the Particles effect can be completely customized. A series of *Presets*, simulating some basic events, are also available. You can look at these Presets to better understand how to set the parameters; or you can use them as the starting point to create your own effects.
es: Mediante el uso de una gran variedad de parámetros disponibles, el efecto Partículas podrá ser completamente personalizado. También se encuentra disponible una serie de *Preajustes*, simulando algunos eventos básicos. Es posible inspeccionar dichos Preajustes para comprender cómo utilizar los parámetros del efecto; o también podrán ser usados como punto de partida para la creación de efectos propios.

source: Particles are defined by parameters organized in different folders: *Source*, *Birth Params*, *Environment*, *Animation* and *Colors*.
es: El efecto Partículas se encuentra organizado en conjuntos de parámetros, dispuestos en las siguientes pestañas: *Origen*, *Nacimiento*, *Entorno*, *Animación* y *Colores*.

source: Particles effect may have unexpected results when the **Stretch** option in Output Settings is used to set a higher FPS value, as this effect requires the original timing information (see :ref:`Choosing the Output Settings <choosing_the_output_settings>` ).
es: Es posible que el efecto Partículas produzca resultados inesperados al utilizar la función **Estirar (fps):** en las Opciones de salida para establecer una velocidad de FPS mayor a la establecida en la escena, debido a que este efecto necesita usar la información original de velocidad para sus cálculos dinámicos (ver :ref:`Elección de Opciones de salida <choosing_the_output_settings>` ).

source: Defining Particle Images
es: Definición de imágenes de Textura

source: Any column/layer content can be used as a particle: its animated content and its animation will be reflected by the particle animation, using the transformations and the drawings exposed in the column/layer cells at the related frame in each point of the particle life.
es: Será posible usar el contenido de cualquier columna/capa como una partícula: tanto su contenido animado, como cualquier animación realizada dentro de Tahoma2D serán reflejados en cada partícula, usando las transformaciones y dibujos expuestos en las celdas de dicha columna/capa, en el fotograma correspondiente a cada instante de la vida de la partícula.

source: For example if a level is exposed in the column/layer at step two, the particle Texture will be animated at step two as well; or if you have a drawing that's spinning because the column/layer is animated, the particle will be spinning as well.
es: Por ejemplo, si un nivel se encontrara expuesto en una columna/capa a cuadro doble, la *Textura* de la partícula también se verá animada a cuadro doble; o si se tuviera un dibujo que estuviera girando debido a la animación de la columna/capa en donde se encuentra expuesto, entonces la partícula se verá girando también.

source: To use a column/layer content as a particle, the column/layer node has to be linked to the **Texture** port of the particles effect node. As soon as a column/layer is linked to the texture input port, a new texture port is available: in this way it is possible to use the content of several columns/layers as particles.
es: Para usar el contenido de una columna/capa como *forma de una partícula*, el nodo correspondiente a dicha columna/capa deberá estar conectado a uno de los conectores *Texture* del nodo del efecto Partículas. En el momento en que un nodo sea conectado al conector *Texture*, aparecerá un nuevo conector *Texture* libre: de esta manera será posible usar el contenido de varias columnas/capas distintas como texturas de partículas.

source: Image formats containing DPI information are loaded using that image DPI; in this case the particles level will be camera resolution independent.
es: Los formatos de imagen que contengan información de PPP serán cargados tomando en cuenta dicha información; en ese caso el nivel de partículas será independiente de la resolución de la cámara activa.

source: Defining Control Images
es: Definición de imágenes de Control

source: A column/layer contents can also be used to control some parameters of the particles effect: its animated content and its animation will affect the particles parameter according to specific image properties, such as brightness or transparency.
es: El contenido de una columna/capa también podrá ser usado para controlar algunos parámetros del efecto Partículas: tanto su contenido animado, como cualquier animación realizada dentro de Tahoma2D, afectarán los parámetros de la simulación de partículas de acuerdo a algunas de las propiedades específicas de las imágenes, tales como su luminosidad o transparencia, dependiendo de cada caso.

source: For example if the level exposed in the column/layer is animated, and the column/layer is used to control the particles **Source**, the particles Source will follow the animation of the level; or if the column/layer is moving and it's used to control the **Gravity** field, the Gravity field will move as well.
es: Por ejemplo, si el nivel expuesto en una columna/capa se encontrara animado, y dicha columna/capa estuviera siendo usada para controlar el parámetro **Origen** de las partículas, el origen seguirá la animación aplicada al nivel; o si la columna/capa estuviera en movimiento y estuviera siendo usada para controlar el parámetro **Gravedad**, el campo de gravedad se movería también durante la simulación.

source: To use a column/layer contents as a Control Image, connect the column/layer node to a **Control** input port of the Particles effect node. As soon as the column/layer is linked to the Control input port, a new Control port is available: in this way it's possible to use the contents of several columns/layers to control the Particles effect.
es: Para usar el contenido de una columna/capa como una *Imagen de control*, es necesario conectar el nodo de la columna/capa a uno de los conectores *Control* del nodo del efecto Partículas. En el momento en que un nodo sea conectado a *Control*, aparecerá un nuevo conector *Control* libre: de esta manera será posible usar el contenido de varias columnas/capas distintas como imágenes de control en distintas partes del efecto.

source: To apply the control image to a parameter, use the related field available in the *FX Settings* panel: to specify a **Control Image**, type the number related to the control image port; to use no control image, type the number **0**.
es: Para aplicar una imagen de control a un parámetro, en el panel *Opciones de efectos* usar el campo correspondiente: para especificar una **Imagen de control**, introducir en el campo correspondiente el número del conector *Control* donde se encuentre conectado el nodo de la columna/capa que se desee usar como imagen de control; para dejar de controlar un parámetro mediante una imagen de control, introducir el número **0** en el campo correspondiente.

source: Some particles presets, such as the grass, have a default value set to `1` in the "Control Image" field. If you're not using one, make sure to set that value back to `0` in order for the preset to work correctly.
es: Algunos ajustes de partículas, tales como el de césped (Grass), contienen un valor predefinido de `1` en el campo **Imagen de control**. En caso de no estar usándose una, asegurarse de establecer dicho valor en `0`, para que el preajuste funcione de forma correcta.

source: When the control images brightness is used to affect a particles parameter, transparent areas are considered as being completely black.
es: Cuando se utilice la luminosidad de una imagen para afectar un parámetro de las partículas, sus áreas transparentes serán consideradas como si fueran completamente negras.

source: Source
es: Origen

source: The particles Source is the area where the particles are generated. It can be defined in the **Source** page, by specifying its size and position, or a control image. The way particles are generated, for example their birth rate, can be controlled as well.
es: Se denomina Origen al área donde las partículas son generadas. Puede ser definido en la pestaña **Origen**, especificando su tamaño y ubicación o a través de una *Imagen de control*. También será posible controlar la forma en que las partículas son generadas, por ejemplo su tasa de nacimiento, fotograma inicial, etc.

source: Control Image
es: Imagen de control

source: Sets if and which control image has to be used for the particles source (see :ref:`Defining Control Images <defining_control_images>`).
es: Permite establecer si deberá usarse una *Imagen de control* para la definición del origen de las partículas y cuál deberá ser usada (ver :ref:`Definición de imágenes de Control <defining_control_images>`).

source: If used, particles are generated only inside the *opaque areas* of the **Control Image**.
es: Si se usara una *Imagen de control*, las partículas serán generadas únicamente dentro de las *áreas opacas* de la misma.

source: Particles generated according to an image-controlled source.
es: Partículas generadas de acuerdo a un origen controlado por una imagen.

source: Threshold
es: Umbral

source: This value defines which pixels of the Control Image are to be used for placing the particles, defining a range based on the opacity value of its pixels. Lower the value and more opaque the pixels have to be for being used as particles generators.
es: Este valor permite definir qué píxeles de la *Imagen de control* serán usados para ubicar partículas, definiendo un rango basado en el valor de opacidad de sus píxeles. Cuanto más bajo sea el valor usado, más opacos deberán ser los píxeles para que sean usados como generadores de partículas.

source: Multiple Generators in Control Image
es: Múltiples generadores en imagen de control

source: When activated, *each* defined opaque area of the Control Image will have the same number of generated particles, totalling the **Birth Rate**. For example if the Birth Rate is 20, and the Control Image has 4 defined opaque areas, 5 particles will be generated in each area.
es: Cuando se encuentre activa, esta opción provocará que *cada* área opaca definida en la *Imagen de control* genere la misma cantidad de partículas, totalizando el número definido en el parámetro **Tasa de natalidad**. Por ejemplo, si *Tasa de natalidad* fuera 20 y la imagen de control contuviera 4 áreas opacas definidas, se generarían 5 partículas en cada una de ellas.

source: Use Control Image Gradation
es: Usar graduación con imagen de control

source: When activated, the intensity of the opacity in the Control Image defines the generation density of the particles. This option cannot be used at the same time as **Multiple Generators in Control Image**.
es: Al estar activa, la intensidad de la opacidad de la *Imagen de control* definirá la generación de las partículas. Esta opción no podrá ser usada al mismo tiempo que **Múltiples generadores en imagen de control**.

source: Center
es: Centro

source: Sets the source Center position, defined by horizontal (X) and vertical (Y) coordinates; it can also be interactively set in the preview of the FX Settings pane, where the Center point is displayed as a cross.
es: El parámetro **Centro** permite definir la posición del centro del área desde donde se emitirán las partículas; también podrá ser definido mediante la pequeña cruz *roja* presente en el área de previsualización del panel Opciones de efectos.

source: If you want to animate the Source to create a trail of particles, you can do it either by animating the Center coordinates, or by animating a column/layer, containing the source area, that has to be used as the Control Image for the Source (see above).
es: Si se deseara animar el *Origen*, para crear una estela de partículas, será posible hacerlo, tanto animando las coordenadas del parámetro **Centro**, como animando una columna/capa que defina el área de origen, usada como *Imagen de control* para el parámetro **Origen** (ver más arriba).

source: The Center can be also set by using a point gadget in the viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ).
es: El centro también podrá ser definido usando el manipulador del efecto en el Visor (ver :ref:`Uso de los Manipuladores de efectos <using_fx_gadgets>` ).

source: The Center *is not* considered in case a Control Image is used.
es: El parámetro **Centro** no será tomado en cuenta en caso de que se estuviera utilizando una *Imagen de control* para definir el origen de las partículas.

source: Width and Height
es: Ancho y Altura

source: Sets the size of the Source area.
es: Permite definir el tamaño del área de origen de las partículas.

source: The **Width** and **Height** can be also set by using a box gadget with handles in the viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ).
es: El ancho y la altura también podrán ser definidos usando el manipulador del efecto en el Visor (ver :ref:`Uso de los Manipuladores de efectos <using_fx_gadgets>` ).

source: These values *are not* considered in case a Control Image is used.
es: Estos valores *no serán* tomados en cuenta en caso de que se estuviera utilizando una *Imagen de control* para definir el origen de las partículas.

source: Particles generated according to a small square source at the center of the camera, and according to a wide box placed at the top of the camera.
es: Partículas generadas de acuerdo a un origen cuadrado y pequeño en el centro de la cámara, y de acuerdo a un rectángulo ancho ubicado en la parte superior de la cámara.

source: Particle Generation
es: Generación de partículas

source: Starting Frame
es: Fotograma inicial

source: Sets the frame at which the particles generation starts.
es: Permite definir el fotograma en el que comenzará la generación de las partículas.

source: When you need a particles event to start before frame 1, you can set a *negative* **Starting Frame** value. For example if you need at frame 1 a snowfall, you cannot make the event start at frame 1, otherwise you will see only the first generated snowflakes; in this case you can set a negative value, for example -20, so that the snowfall has already evolved for 20 frames before being displayed at frame 1.
es: Cuando se necesite que un evento de partículas comience antes del fotograma 1, será posible definir un valor *negativo* para el parámetro **Fotograma inicial**. Por ejemplo, si se necesitara en el fotograma 1 tener nieve cayendo, no podrá iniciarse la simulación en el fotograma 1, de otra forma únicamente se verían los primeros copos generados; en este caso será posible definir un valor negativo, por ejemplo -20, para que la nevada haya ya evolucionado durante 20 fotogramas antes de ser mostrada en el fotograma 1.

source: As the Starting Frame is an effect parameter, moving the Particles effect *level* up or down in the Xsheet (or left or right in the Timeline) will not change the actual starting frame: the parameter itself has to be edited.
es: Como **Fotograma inicial** es un parámetro ingresado directamente en el efecto, mover el *nivel* del efecto Partículas hacia adelante o atrás en el tiempo no cambiará el fotograma en el que comenzará la simulación: será necesario editar el parámetro en el panel Opciones de efectos.

source: If the **Starting Frame** is higher than the first frame where a **Birth Rate** is set, the former value is used as the starting point of the event. For example if the Starting Frame is 20 and first frame with a positive Birth Rate is frame 15, from frame 15 to 20 no particles will be generated.
es: Si el parámetro **Fotograma inicial** fuera mayor que el primer fotograma donde se hubiera definido un valor positivo de **Tasa de natalidad**, el primer valor será usado como comienzo de la simulación. Por ejemplo, si *Fotograma inicial* fuera 20 y el primer fotograma con un valor positivo de *Tasa de natalidad* fuera el 15, desde el fotograma 15 al 20 no se generarán partículas.

source: Birth Rate
es: Tasa de natalidad

source: Sets the number of particles to be generated in each frame. When the value is constant, in each frame the same number of particles will be generated. For example if the Birth Rate at frame 1 is 20, the first frame will contain 20 particles, the second 40, the third 60, and so on.
es: Permite definir la cantidad de partículas a ser generadas en cada fotograma. Cuando el valor fuera constante, se generará la misma cantidad de partículas en cada fotograma. Por ejemplo, si el parámetro **Tasa de natalidad** en el fotograma 1 fuera de 20, el primer fotograma contendrá 20 partículas, el segundo 40, el tercero 60 y así sucesivamente.

source: The Birth Rate value considers also decimal numbers. For example, if you set the birth rate to 0.2, a particle each five frames will be generated (0.2 multiplied by 5 is equal to 1 particle).
es: El parámetro **Tasa de natalidad** también tomará en cuenta valores decimales. Por ejemplo, si se definiera en 0.2, se generará una partícula cada 5 fotogramas (0.2 multiplicado por 5 es igual a 1).

source: By animating the Birth Rate, you can control the quantity of particles in the effect. For example if you want only 20 particles starting from frame 1, you need to set a key at frame 1 with the Birth Rate set to 20, and another key at frame 2 with the Birth Rate set to 0.
es: Será posible controlar la cantidad de partículas en el efecto, mediante la animación del parámetro **Tasa de natalidad**. Por ejemplo, si se deseara tener sólo 20 partículas comenzando en el fotograma 1, se necesitará marcar un clave en el fotograma 1 con una *Tasa de natalidad* de 20, y otro clave en el fotograma 2 con una *Tasa de natalidad* de 0.

source: Animation Step
es: Exposición de animación

source: Sets the step of the whole particles animation. This allows you to match the animation of the particle effect with the animation in the scene, in case the scene uses an animation step different from 1.
es: Permite definir la exposición para la animación de las partículas. Esto permitirá hacer coincidir la animación del efecto de partículas con la animación del resto de la escena, en caso de que la escena usara una exposición distinta a 1.

source: Random Seed
es: Semilla

source: Creates a different particles configuration. With the same parameters values and the same Random Seed the particles configuration is always the same; changing the Random Seed allows you to retain all the set parameters but to change the particles configuration. Only integer numbers are considered.
es: Permite crear distintas configuraciones de partículas. Si se usaran los mismos valores en todos los parámetros y el mismo valor de **Semilla**, las simulaciones de partículas serían siempre idénticas; cambiar el valor de este parámetro permitirá obtener simulaciones distintas, manteniendo iguales los valores de todos los demás parámetros. Sólo se considerarán números enteros.

source: Particle
es: Partículas

source: Animation
es: Animación

source: The particle animation follows the source node content, but you can decide how that content is used, especially in case the Particles effect is longer than the Texture columns/layers content. The following options are available:
es: Las partículas seguirán la animación del contenido del nodo que les de forma, sin embargo podrá definirse cómo deberá ser usado ese contenido, especialmente en caso de que el efecto Partículas durara más que el contenido de las columnas/capas conectadas a los conectores *Texture*. Se encuentran disponibles las siguientes opciones:

source: **Hold Frame** randomly assigns a frame from the Texture node content to each generated particle; that frame is kept throughout the life of the particle.
es: **Fotograma fijo** asigna de forma aleatoria un fotograma del contenido conectado a *Texture* a cada partícula, en el momento en que ésta es generada; ese fotograma será mantenido durante toda la vida de la partícula.

source: **Random Frame** randomly assigns a frame from the Texture node content to each generated particle, changing it randomly at each frame of the particle lifetime.
es: **Fotograma aleatorio** asigna de forma aleatoria un fotograma del contenido conectado a *Texture* a cada partícula, en el momento en que ésta es generada; cambiándolo aleatoriamente en cada fotograma durante toda la vida de la partícula.

source: **Column** assigns *the first frame* from the Texture node content to each particle when it is generated; the animation cycles following the Texture node content order throughout the life of the particle.
es: **Columna** asigna *el primer fotograma* del contenido de la columna/capa conectada a *Texture* a cada partícula, en el momento en que ésta es generada; a partir de ahí la animación se sucederá siguiendo el orden normal de la columna/capa, tantas veces como sea necesario hasta que se complete la vida de la partícula.

source: **Column - Random Start** randomly assigns a frame from the Texture node content to each particle when it is generated; the animation cycles following the Texture content order throughout the life of the particle starting from the assigned frame.
es: **Columna - Inicio aleatorio** asigna un fotograma aleatorio del contenido de la columna/capa conectada a *Texture* a cada partícula, en el momento en que ésta es generada; a partir de ahí la animación se sucederá siguiendo el orden normal de la columna/capa, tantas veces como sea necesario hasta que se complete la vida de la partícula.

source: **Column Swing - Random Start** randomly assigns a frame from the Texture node content to each particle when it is generated; the animation moves from the assigned frame to the last or to the first, then keeps on swinging back and forth along the frames sequence, throughout the life of the particle.
es: **Columna oscilante - Inicio aleatorio** asigna un fotograma aleatorio del contenido de la columna/capa conectada a *Texture* a cada partícula, en el momento en que ésta es generada; a partir de ahí la animación se sucederá siguiendo el orden normal de la columna/capa y luego en sentido inverso hasta el comienzo, oscilando tantas veces como sea necesario hasta que se complete la vida de la partícula.

source: Birth Parameters
es: Nacimiento

source: Each particle, when generated at the current frame, has some parameters that are assigned and retained throughout its life. Those attributes can be set in the **Birth Params** page.
es: Cada partícula, en el momento en que es generada, contendrá ciertos parámetros que serán asignados y mantenidos a lo largo de toda su vida. Esos atributos podrán ser definidos en la pestaña **Nacimiento**.

source: Speed
es: Velocidad

source: Assigns a speed and a direction for each generated particle.
es: En esta sección será posible asignar una velocidad y dirección a cada partícula generada.
