Repository: tahoma2d/tahoma2d_docs
Catalog: source/locale/*/LC_MESSAGES/using_the_particles_effect.po
Languages: es

source: Assigns randomly a speed to each particle, according to the minimum and maximum values.
es: Permite asignar aleatoriamente una velocidad a cada partícula, de acuerdo a los valores mínimo y máximo.

source: The speed value makes the particle move constantly as frames increase, and is expressed in the chosen unit of measure per frame. A negative value makes the particle move in the opposite direction of the one set by the angle.
es: El valor de velocidad hará que las partículas se muevan de forma constante a medida que los fotogramas aumenten, se encuentra expresada en unidades por fotograma. Un valor negativo hará que las partículas se muevan en la dirección opuesta a la definida por el parámetro *Dirección de la velocidad*.

source: Sets if and which control image has to be used to control the particles speed (see :ref:`Defining Control Images <defining_control_images>` ).
es: Permite establecer si deberá usarse una *Imagen de control* para controlar la velocidad de las partículas y cuál deberá ser usada (ver :ref:`Definición de imágenes de Control <defining_control_images>`).

source: If used, the speed value range defined above will be distributed according to the brightness value of the control image pixel where the particle is generated: particles will be faster where the image is brighter.
es: Si se usara, el rango de valores de velocidad definido arriba se distribuirá de acuerdo a la luminosidad del píxel de la *Imagen de control* donde la partícula fuera generada: resultando en partículas más veloces donde la imagen fuera más luminosa.

source: Linked to Scale
es: Vincular con la escala

source: Assigns to each particle a speed value, taken between the minimum and maximum speed, according to the Size value applied to the particle. This causes the largest particles to be the fastest, emphasizing a depth of field effect.
es: Permite asignar a cada partícula un valor de velocidad, tomado entre el mínimo y el máximo, de acuerdo al valor de **Tamaño** aplicado a la partícula. Esto provocará que las partículas más grandes sean más veloces, acentuando un efecto de profundidad de campo.

source: Speed Angle
es: Dirección de la velocidad

source: Assigns randomly to each particle an angle value defining the speed direction, according to the minimum and maximum values.
es: Permite asignar aleatoriamente a cada partícula un valor de ángulo que definirá la dirección de la velocidad, de acuerdo a los valores mínimo y máximo.

source: The value 0 is for an upward direction; higher values turn the direction clockwise.
es: El valor 0 representa la dirección hacia arriba; valores positivos causarán un giro en sentido horario.

source: A particle animation with different random speed, and with different random speed and direction angle.
es: Una animación de partículas con diferentes velocidades aleatorias, y con diferentes velocidades y direcciones aleatorias.

source: Use Gradient Angle
es: Usar dirección del gradiente

source: When activated, adjusts the initial velocity to the gradient vector of the Control Image **Speed Angle**.
es: Al estar activada, permite ajustar la velocidad inicial al vector del gradiente de **Dirección de la velocidad** de la *Imagen de control*.

source: Size, Mass and Orientation
es: Tamaño, masa y orientación

source: Size
es: Tamaño

source: Assigns randomly a size to each particle, according to the minimum and maximum values. The size is expressed as a percentage, where 100 is the original size.
es: Permite asignar aleatoriamente un tamaño a cada partícula, de acuerdo a los valores mínimo y máximo. El tamaño estará expresado como un porcentaje, donde 100 será el tamaño original.

source: Particles generated with a fixed size and with a random one.
es: Partículas generadas con un tamaño fijo y uno aleatorio.

source: Perspective Distribution
es: Distribución en perspectiva

source: When activated, and if a Control Image for **Size** is connected, particles size will be inversely proportional to their density. It can be used for placement of depth particles, as in a sea waves level. When this option is active, the **Use Control Image Gradation** option will be ignored.
es: Al estar activa, y si hubiera conectada una *Imagen de control* para el parámetro **Tamaño**, los tamaños de las partículas serán inversamente proporcionales a su densidad. Podrá ser usada para la ubicación de partículas en profundidad, como en un nivel que contenga ondas de mar. Cuando esta opción estuviera activa, la opción **Usar graduación con imagen de control** será ignorada.

source: Sets if and which control image has to be used to control particles size (see :ref:`Defining Control Images <defining_control_images>` ).
es: Permite establecer si deberá usarse una *Imagen de control* para controlar el tamaño de las partículas y cuál deberá ser usada (ver :ref:`Definición de imágenes de Control <defining_control_images>`).

source: If used, the size value range defined above will be distributed according to the brightness value of the control image pixel where the particle is generated: particles will be larger where the image is brighter.
es: Si se usara, el rango de valores de tamaño definido arriba se distribuirá de acuerdo a la luminosidad del píxel de la *Imagen de control* donde la partícula fuera generada: resultando en partículas de mayor tamaño donde la imagen fuera más luminosa.

source: Use Control Image for the Whole Lifetime
es: Usar imagen de control para la vida completa

source: If activated, the defined control image is used to set the particles size for each frame of the particles life, ignoring any Size Increase value.
es: Si esta opción se encontrara activa, la imagen de control especificada será usada para definir el tamaño de las partículas en cada fotograma de su vida, ignorando los valores de la sección **Aumento de tamaño**.

source: If deactivated the control image is used only at the birth of the particles, and any size variation depends only on the Size Increase value (see :ref:`Size Increase <size_increase>` ).
es: Si esta opción se encontrara inactiva, la imagen de control será usada únicamente en el instante del nacimiento de las partículas, y sus posteriores cambios de tamaño dependerán únicamente de los valores de la sección **Aumento de tamaño**.

source: Mass
es: Masa

source: Assigns randomly a mass to each particle, according to the minimum and maximum values. The mass is taken into account when gravity affects the particles behavior.
es: Permite asignar aleatoriamente un valor de masa a cada partícula, de acuerdo a los valores mínimo y máximo. El valor de masa será tomado en cuenta cuando la gravedad afecte al comportamiento de las partículas.

source: Orientation
es: Orientación

source: Assigns randomly an orientation to each particle, according to the minimum and maximum angle values.
es: Permite asignar aleatoriamente una orientación a cada partícula, de acuerdo a los valores mínimo y máximo.

source: The value 0 leaves the image as is; increasing values turn the particle clockwise.
es: El valor 0 dejará la imagen tal como es originalmente; valores positivos causarán un giro en sentido horario.

source: Sets if and which control image has to be used to control particles orientation (see :ref:`Defining Control Images <defining_control_images>` ).
es: Permite establecer si deberá usarse una *Imagen de control* para controlar la orientación de las partículas y cuál deberá ser usada (ver :ref:`Definición de imágenes de Control <defining_control_images>`).

source: If used, the orientation value range defined above will be distributed according to the brightness value of the control image pixel where the particle is generated.
es: Si se usara, el rango de valores de orientación definido arriba se distribuirá de acuerdo a la luminosidad del píxel de la *Imagen de control* donde la partícula fuera generada.

source: Different random orientation assigned to same-size and to different-sized particles.
es: Distintas orientaciones aleatorias asignadas a partículas del mismo tamaño y de distintos tamaños.

source: Trail
es: Estela

source: Allows you to define a trail according to the particle motion by specifying how many previous frames positions have to be used to generate the trail. The number of frames the trail lasts is randomly assigned according to the minimum and maximum values.
es: Permite definir una estela de acuerdo al movimiento de las partículas, especificando de cuántos fotogramas anteriores deberán usarse las posiciones para generarla. La cantidad de fotogramas que dure cada estela será asignada aleatoriamente de acuerdo a los valores mínimo y máximo.

source: Step
es: Intervalo

source: Sets how many particles will be visible in the trail. For example, if the trail value is 10 and the step is set to 2, the trail will be 10 frames long, but only five particles, one every two frames, will be visible.
es: Permite definir cuántas partículas estarán visibles en la estela. Por ejemplo, si el valor del parámetro **Estela** fuera 10 y el de **Intervalo** 2, la estela se extenderá a lo largo de 10 fotogramas, pero sólo contendrá 5 partículas visibles, una cada dos fotogramas.

source: Lifetime
es: Vida

source: Assigns randomly a lifetime to each particle, according to the minimum and maximum values. The lifetime is the number of frames the particle will last before disappearing.
es: Permite asignar aleatoriamente la vida a cada partícula, de acuerdo a los valores mínimo y máximo. La vida es la cantidad de fotogramas que la partícula durará antes de desaparecer.

source: For example if a particle is generated at frame 15 with an assigned lifetime value of 20, it will last till frame 35, disappearing at frame 36.
es: Por ejemplo, si una partícula fuera generada en el fotograma 15 con una vida asignada de 20, durará hasta el fotograma 35, desapareciendo en el 36.

source: Sets if and which control image has to be used to control particles lifetime (see :ref:`Defining Control Images <defining_control_images>` ).
es: Permite establecer si deberá usarse una *Imagen de control* para controlar la vida de las partículas y cuál deberá ser usada (ver :ref:`Definición de imágenes de Control <defining_control_images>`).

source: If used, the lifetime value range defined above will be distributed according to the brightness value of the control image pixel where the particle is generated: particles will live longer where the image is brighter.
es: Si se usara, el rango de valores de duración definido arriba se distribuirá de acuerdo a la luminosidad del píxel de la *Imagen de control* donde la partícula fuera generada: resultando en partículas de mayor duración donde la imagen sea más luminosa.

source: Use Column Duration for Lifetime
es: Duración de la columna define la vida

source: Limits the particles lifetime to the number of frames the column/layer content used as particles source lasts.
es: Permite limitar la vida de las partículas a la duración del contenido de la columna/capa usada como origen de las partículas.

source: The particle animation remains the one defined in the Animation parameters (see :ref:`Animation <particle>` ).
es: El comportamiento de la animación de las partículas permanecerá siendo el definido mediante el parámetro **Animación** (ver :ref:`Animación <particle>` ).

source: Top Layer
es: Orden de composición

source: Defines the layering order of the generated particles. Options are the following:
es: Permite definir el orden de composición de las partículas generadas. Las opciones disponibles son las siguientes:

source: **Younger** places the latest generated particles on top of all the others.
es: **Más joven**, ubica las partículas generadas más recientemente por sobre las anteriores.

source: **Older** places the latest generated particles behind the previously generated ones.
es: **Más vieja**, ubica las partículas generadas anteriormente por sobre las más recientes.

source: **Smaller** places smaller particles on top of the bigger ones.
es: **Más pequeña**, ubica las partículas de menor tamaño por sobre las más grandes.

source: **Bigger** places bigger particles on top of the smaller ones.
es: **Más grande**, ubica las partículas de mayor tamaño por sobre las más pequeñas.

source: **Random** places each particle randomly in-between the previously generated particles.
es: **Aleatorio**, ubica cada nueva partícula de forma aleatoria entre las generadas anteriormente.

source: Environment
es: Entorno

source: Particles behavior defined by their birth parameters can be affected by external events, such as gravity and wind, that can be defined in the Environment page.
es: El comportamiento de las partículas, definido por sus parámetros de nacimiento, podrá ser afectado por eventos externos, como una gravedad y viento, que podrán ser definidos en la pestaña **Entorno**.

source: Gravity
es: Gravedad

source: Simulates a single direction force that accelerates the particles, as gravity does.
es: Permite simular una fuerza de una dirección única que acelerará las partículas, tal como sucede con la gravedad.

source: Sets the acceleration of gravity acting upon the particles: the motion generated by the intensity of the gravity increases as frames increase.
es: Permite definir la aceleración de la gravedad que actúa sobre las partículas: el movimiento generado por la intensidad de la gravedad aumentará a medida que avancen los fotogramas.

source: A negative value makes the particle accelerate in the opposite direction of the one set by the angle.
es: Un valor negativo provocará que las partículas aceleren en la dirección opuesta a la establecida por la *Dirección de la gravedad*.

source: Gravity Angle
es: Dirección de la gravedad

source: Defines the gravity direction. The value 0 is for a downward direction; higher values turn the direction clockwise.
es: Permite definir la dirección de la gravedad. El valor 0 representa una dirección vertical descendente; valores positivos causarán un giro en sentido horario.

source: A particle animation without and with gravity.
es: Una animación de partículas sin gravedad y con gravedad.

source: Sets if and which control image has to be used to define a gravity field affecting the particles motion (see :ref:`Defining Control Images <defining_control_images>` ).
es: Permite establecer si deberá usarse una *Imagen de control* para definir un campo de gravedad que afecte a las partículas y cuál deberá ser usada (ver :ref:`Definición de imágenes de Control <defining_control_images>`).

source: If used, the particles will be attracted by the brighter areas of the image, ignoring the set Gravity Angle value: the brightest areas of the image will have the Gravity value you set. For best results, the dark and light areas should be smoothly blended.
es: Si se usara, las partículas se verán atraídas por las áreas más luminosas de la imagen, ignorando al valor en **Dirección de la gravedad**: las áreas más luminosas de la imagen tendrán el valor de gravedad especificado en el parámetro **Gravedad**. Para obtener mejores resultados, las áreas oscuras y claras de la imagen deberían fundirse suavemente.

source: A single particle movement without and with an image-controlled gravity.
es: El movimiento de una única partícula con una gravedad constante y luego con una imagen controlando la gravedad.

source: Friction
es: Fricción

source: Simulates a force which has a direction opposite to the motion of the particles, in order to slow them down, or to stop them.
es: Permite simular una fuerza con dirección opuesta al movimiento de las partículas, para enlentecer su movimiento hasta detenerlo completamente.

source: A negative value makes the particles accelerate in the direction of their own motion.
es: Un valor negativo provocará la aceleración de las partículas en la dirección de su propio movimiento.

source: Sets if and which control image has to be used to define a friction field affecting the particles speed (see :ref:`Defining Control Images <defining_control_images>` ).
es: Permite establecer si deberá usarse una *Imagen de control* para definir un campo de fricción que afecte la velocidad de las partículas y cuál deberá ser usada (ver :ref:`Definición de imágenes de Control <defining_control_images>`).

source: If used, the particles motion will be affected by the brighter areas of the image: the brightest areas of the image will have the Friction value you set. For best results, the dark and light areas should be smoothly blended. If you want the particles to stop suddenly, use a high intensity value.
es: Si se usara, el movimiento de las partículas se verá afectado por las áreas más luminosas de la imagen: las áreas más luminosas de la imagen tendrán el valor de fricción especificado en el parámetro **Fricción**. Si se deseara que las partículas se detuvieran súbitamente, deberá utilizarse un valor alto de intensidad.

source: A particle animation with an image-controlled friction.
es: Una animación de partículas con la fricción controlada por una imagen.

source: Wind
es: Viento

source: Simulates a speed that is added to the particles speed. The speed is constant, this means that there is no acceleration in the motion of the particles.
es: Permite simular una velocidad que será adicionada a la de las partículas. La velocidad es constante, esto significa que no habrá aceleración en el movimiento de las partículas.

source: Wind Intensity
es: Intensidad viento

source: Sets the wind speed. A negative value makes the particle move in the opposite direction of the one set by the angle.
es: Permite establecer la velocidad del viento. Un valor negativo provocará que la partícula se mueva en dirección opuesta a la definida por la *Dirección del viento*.

source: Wind Angle
es: Dirección del viento

source: Sets the angle value defining the wind speed direction.The value 0 is for an upward direction; higher values turn the direction clockwise.
es: Permite definir la dirección del viento. El valor 0 representa una dirección vertical ascendente; valores positivos causarán un giro en sentido horario.

source: For example if a particle is standing still, and at frame 10 a wind starts with an intensity of 50 and an angle of 90, the particle will move constantly rightward at each frame.
es: Por ejemplo, si una partícula se encontrara en reposo, y en el fotograma 10 comenzara a soplar un viento con una intensidad de 50 y una dirección de 90 grados, la partícula se moverá con una velocidad constante hacia la derecha en cada fotograma.

source: Scattering
es: Dispersión

source: Sets a random horizontal and vertical displacement that is added to the movement of the particles.
es: Permite establecer un desplazamiento horizontal y vertical aleatorio que se adicionará al movimiento de las partículas.

source: Sets the minimum and maximum displacement that can be generated and randomly added to the horizontal component of the particle movement. Positive values shifts the particle to the right; negative ones to the left.
es: Permite definir el desplazamiento mínimo y máximo que podrá ser adicionado aleatoriamente al componente horizontal del movimiento de las partículas. Valores positivos causarán un desplazamiento hacia la derecha; mientras que los negativos lo harán hacia la izquierda.

source: Sets the minimum and maximum displacement that can be generated and randomly added to the vertical component of the particle movement. Positive values shifts the particle to the top; negative ones to the bottom.
es: Permite definir el desplazamiento mínimo y máximo que podrá ser adicionado aleatoriamente al componente vertical del movimiento de las partículas. Valores positivos causarán un desplazamiento hacia arriba; mientras que los negativos lo harán hacia abajo.

source: H Control Image
es: Imagen de control H

source: Sets if and which control image has to be used to control the horizontal scattering value (see :ref:`Defining Control Images <defining_control_images>` ).
es: Permite establecer si deberá usarse una *Imagen de control* para definir el valor de dispersión horizontal y cuál deberá ser usada (ver :ref:`Definición de imágenes de Control <defining_control_images>`).

source: If used, the horizontal scattering value range defined above will be distributed according to the brightness value of the control image: the horizontal scattering will be higher where the image is brighter.
es: Si se usara, el rango de valores de dispersión horizontal definido más arriba será distribuido de acuerdo a los valores de luminosidad de la *Imagen de control*: la dispersión horizontal será más alta donde la imagen sea más luminosa.

source: V Control Image
es: Imagen de control V

source: Sets if and which control image has to be used to control the vertical scattering value (see :ref:`Defining Control Images <defining_control_images>` ).
es: Permite establecer si deberá usarse una *Imagen de control* para definir el valor de dispersión vertical y cuál deberá ser usada (ver :ref:`Definición de imágenes de Control <defining_control_images>`).

source: If used, the vertical scattering value range defined above will be distributed according to the brightness value of the control image: the vertical scattering will be higher where the image is brighter.
es: Si se usara, el rango de valores de dispersión vertical definido más arriba será distribuido de acuerdo a los valores de luminosidad de la *Imagen de control*: la dispersión vertical será más alta donde la imagen sea más luminosa.

source: Swing Mode
es: Modo de oscilación

source: Sets the way the scattering values are used; options are the following:
es: Permite definir la forma en que los valores de dispersión serán usados; las opciones disponibles son las siguientes:

source: **Random** adds the horizontal and vertical scattering values to the particle movement at each frame.
es: **Aleatorio** adicionará los valores de dispersión horizontal y vertical al movimiento de las partículas en cada fotograma.

source: **Smooth** reaches the horizontal and vertical scattering values by interpolating values, in order to create a smooth movement. The interpolation lasts as many frames as set by the swing value set below; when the scattering values are reached, new values for each parameter are generated.
es: **Suave**, permitirá alcanzar los valores de dispersión horizontal y vertical mediante una interpolación suave. La interpolación durará tantos fotogramas como se indique en el valor **Oscilación** de abajo; una vez éstos se hubieran alcanzado, se generarán nuevos valores para cada parámetro.

source: Swing
es: Oscilación

source: Sets the minimum and maximum number of frames throughout which the horizontal and vertical scattering values will vary, while remaining either positive or negative. This allows you to set a swinging movement where each swing lasts a random number of frames, still having a random scattering at each frame.
es: Permite definir la cantidad mínima y máxima de fotogramas a lo largo de los cuales variarán los valores de dispersión horizontal y vertical, mientras se mantienen siendo positivos o negativos. Esto permitirá definir un movimiento oscilatorio, donde cada ciclo durará una cierta cantidad aleatoria de fotogramas, y teniendo una dispersión aleatoria en cada fotograma.
