Repository: tahoma2d/tahoma2d_docs
Catalog: source/locale/*/LC_MESSAGES/using_ffmpeg_with_opentoonz.po
Languages: es

source: Using FFmpeg with Tahoma
es: Uso de FFmpeg con Tahoma2D

source: What is FFmpeg?
es: ¿Qué es FFmpeg?

source: To render your animation as an **mp4** or **webm**, or also as a **gif** on Mac, Tahoma requires the FFmpeg multimedia framework to be installed on your machine.
es: Para poder procesar y exportar una animación en formatos como **mp4** o **webm** (o también como **gif**, en macOS), Tahoma2D necesita que FFmpeg esté instalado en el sistema.

source: For more information, please visit this page: `About FFmpeg <https://www.ffmpeg.org/about.html>`_
es: Para más información, por favor visitar la siguiente página (en inglés): `About FFmpeg <https://www.ffmpeg.org/about.html>`_

source: Installing FFmpeg for Windows
es: Instalación de FFmpeg en Windows

source: Downloading
es: Descarga

source: To download FFmpeg, first visit this page: `Download FFmpeg <https://www.ffmpeg.org/download.html>`_
es: Para descargar FFmpeg, primero visitar la siguiente página (en inglés): `Download FFmpeg <https://www.ffmpeg.org/download.html>`_

source: Select the Windows icon and then select the **Windows builds** link:
es: Seleccionar el ícono de Windows y luego seleccionar el enlace **Windows builds**:

source: You will be taken to an **FFmpeg Builds** page with some options for the version of FFmpeg that you want to download:
es: Eso llevará a una página de descargas **FFmpeg Builds** con varias opciones para elegir la versión de FFmpeg que se desee descargar:

source: In the majority of cases, the default choices are fine.
es: En la mayoría de los casos, las opciones predefinidas serán correctas.

source: Click on the blue **Download Build** button, this will begin downloading a zip archive containing FFmpeg.
es: Hacer clic en el botón azul **Download Build**, esto comenzará con la descarga de un archivo comprimido zip conteniendo el FFmpeg.

source: Installing
es: Instalación

source: Once you have downloaded the FFmpeg zip archive, open it and double-click on the first folder.
es: Una vez que se haya descargado el archivo comprimido zip del FFmpeg, abrirlo y hacer doble-clic en la primera carpeta.

source: Within the **bin** folder are the executable files that you will need.
es: Dentro de la carpeta **bin** se encuentran los archivos ejecutables necesarios.

source: Create a new folder on your computer, the recommended location is **C:\\**.
es: Crear una nueva carpeta en el sistema, la ubicación recomendada es **C:\\**.

source: Name the new folder **FFmpeg**.
es: Nombrar a la nueva carpeta **FFmpeg**.

source: Drag the contents of the **bin** folder from the archive into the newly created folder.
es: Arrastrar el contenido de la carpeta **bin** desde el archivo zip hasta la nueva carpeta.

source: Next, start Tahoma and open the **Preferences** window with File → **Preferences...**
es: A continuación, ejecutar Tahoma2D y abrir la ventana Archivo → **Preferencias...**

source: Navigate to the **Import/Export** category; at the top you will see a box with the text **FFmpeg path**.
es: Navegar a la categoría **Importación/Exportación**; en la parte superior está la opción **Ruta a FFmpeg**.

source: Insert the path to your FFmpeg folder that you created earlier, if you have used the recommended path, this will be **C:\\FFmpeg\\**:
es: Ingresar la ruta a la carpeta recién creada, según las recomendaciones previas, esta sería: **C:\\FFmpeg\\**:

source: Restart Tahoma.
es: Reiniciar Tahoma2D.

source: Open the **Output Settings** window with Render → **Output Settings...**
es: Abrir la ventana Procesamiento → **Opciones de salida...**

source: In the **File Settings** subsection, you should now see **mp4** and **webm**.
es: En la subsección **Opciones de archivo**, ahora deberían estar disponibles **mp4** y **webm**.

source: Installing FFmpeg for Mac
es: Instalación de FFmpeg en macOS

source: Select the Apple icon and select the **Static and Shared builds** link.
es: Seleccionar el ícono de Apple y seleccionar el enlace **Static and Shared builds**.

source: Make sure **macOS 64-bit** is selected under the **Architecture** column.
es: Asegurarse de que **macOS 64-bit** esté seleccionado en la columna **Architecture**.

source: Open Finder and create a new folder, the **Applications/Tahoma** folder is the recommended location.
es: Abrir el Finder y crear una nueva carpeta, la ubicación recomendada es la carpeta **Applications/Tahoma**.

source: Name the new folder **FFmpeg**
es: Nombrar a la nueva carpeta **FFmpeg**.

source: For macOS 10.15 and later, each executable within the FFmpeg folder needs to be opened before using Tahoma (this only needs to be done one time, due to security features). In Finder, right-click on each executable (ffmpeg, ffprobe, and etc.) and select ``Open With → Terminal``. Once the Terminal windows have launched successfully, Terminal can be closed.
es: Para macOS 10.15 y posteriores, cada ejecutable dentro de la carpeta FFmpeg necesitará ser abierto antes de usar Tahoma2D (sólo se necesitará hacer esto una única vez, debido a funciones de seguridad del sistema). En el Finder, hacer clic derecho en cada uno de los ejecutables (ffmpeg, ffprobe, etc.) y seleccionar ``Abrir con → Terminal``. Una vez que las ventanas de la Terminal se hayan abierto exitosamente, podrán ser cerradas.

source: Insert the path to your FFmpeg folder that you created earlier, if you have used the recommended path, this will be **/Applications/Tahoma/FFmpeg**:
es: Ingresar la ruta a la carpeta de FFmpeg creada previamente, si se usó la ruta recomendada, esta sería: **/Applications/Tahoma/FFmpeg**:

source: In the **File Settings** subsection, you should now see **mp4**, **webm** and **gif**.
es: En la subsección **Opciones de archivo**, ahora deberían estar disponibles **mp4**, **webm** y **gif**.

source: Installing FFmpeg for Linux
es: Instalación de FFmpeg en Linux

source: To install FFmpeg, enter the following command in the shell depending on your distribution.
es: Para instalar FFmpeg, ingresar el siguiente comando en la consola, dependiendo de la distribución usada.

source: If you are using a other Linux distribution please refer to its documentation or visit the `FFmpeg website <https://www.ffmpeg.org/download.html>`_.
es: Si se está usando otra distribución de Linux, por favor referirse a su documentación o visitar `el sitio de FFmpeg <https://www.ffmpeg.org/download.html>`_.

source: To make it possible to export files in **mp4**, **webm** or **gif** formats, you need to specify the path to FFmpeg installed on your system, usually it is **/usr/bin/ffmpeg**. Enter command ``which ffmpeg`` in the shell to find out.
es: Para que sea posible exportar archivos en formatos **mp4**, **webm** o **gif**, es necesario indicar la ruta a la versión de FFmpeg instalada en el sistema, que usualmente es: **/usr/bin/ffmpeg**. Es posible usar el comando ``which ffmpeg`` en la consola para averiguar esto.

source: Start Tahoma and open the **Preferences** window with File → **Preferences...**
es: Ejecutar Tahoma2D y abrir la ventana Archivo → **Preferencias...**

source: Insert the path **/usr/bin**.
es: Ingresar la ruta **/usr/bin**.
