Repository: tahoma2d/tahoma2d_docs
Catalog: source/locale/*/LC_MESSAGES/whats_new.po
Languages: es

source: What's New in Tahoma2D
es: Novedades

source: Tahoma2D includes a number of improvements from OpenToonz. It also includes the latest features and bug fixes from OpenToonz.
es: Tahoma2D incluye una cantidad de mejoras provenientes de OpenToonz. También incluye las últimas características y correcciones de errores de OpenToonz.

source: In this section you can find a list of Highlights in the latest release of Tahoma2D; these may include New Features, Bug Fixes or Enhancements to already existent features. Here, you can also find links to past versions' Release Notes, to keep track of Tahoma2D development history throughout time.
es: En esta sección se podrá encontrar una lista de las novedades destacadas de la última versión de Tahoma2D; éstas podrán incluir Nuevas funciones, Correcciones de errores o Mejoras a funciones ya existentes. También podrán encontrarse aquí enlaces a las novedades de las versiones anteriores, para poder llevar un recuento de la historia de desarrollo de Tahoma2D a lo largo del tiempo.

source: New in Tahoma2D 1.5.1
es: Novedades en Tahoma2D 1.5.1

source: Added
es: Nuevo

source: High DPI Scaling preference
es: Opción en preferencias para el escalado en monitores con alta densidad de PPP

source: Added CHANGELOG.md
es: Se agregó un archivo CHANGELOG.md

source: Changed
es: Cambios

source: Fix Gap Closure results (Tape Tool)
es: Se corrigió el resultado al cerrar huecos (herramienta Cinta)

source: Fixed
es: Correciones

source: Fix relative drawing onion skin guided drawing
es: Se corrigió el dibujado de la piel de cebolla relativa en modo Dibujos

source: Fix update folder delay *(OpenToonz port)*
es: Se corrigió retraso en actualizar carpeta *(transportado desde OpenToonz)*

source: Other
es: Otros

source: Brazilian Portuguese Translation - Review + Update to 1.5
es: Traducción al portugués de Brasil - Revisión + actualización a 1.5

source: Update Canon EDSDK to v13.18.40
es: Se actualizó el EDSDK de Canon a v13.18.40

source: For more detailed information of these changes, visit the links provided in the `v1.5.1 Release Notes <https://github.com/tahoma2d/tahoma2d/releases/tag/v1.5.1>`_ hosted in GitHub.
es: Para información más detallada de estos cambios, visitar los enlaces proporcionados en las `Novedades de la v1.5.1 <https://github.com/tahoma2d/tahoma2d/releases/tag/v1.5.1>`_ alojadas en GitHub.

source: Previous Versions
es: Versiones anteriores

source: Here you can find links to previous versions' full Release Notes, hosted in GitHub:
es: Aquí es posible encontrar enlaces a las Novedades de las versiones anteriores (en inglés), alojadas en GitHub:

source: `v1.5 Release Notes <https://github.com/tahoma2d/tahoma2d/releases/tag/v1.5>`_
es: `Novedades de la v1.5 <https://github.com/tahoma2d/tahoma2d/releases/tag/v1.5>`_

source: `v1.4.5 Release Notes <https://github.com/tahoma2d/tahoma2d/releases/tag/v1.4.5>`_
es: `Novedades de la v1.4.5 <https://github.com/tahoma2d/tahoma2d/releases/tag/v1.4.5>`_

source: `v1.4.4 Release Notes <https://github.com/tahoma2d/tahoma2d/releases/tag/v1.4.4>`_
es: `Novedades de la v1.4.4 <https://github.com/tahoma2d/tahoma2d/releases/tag/v1.4.4>`_

source: `v1.4.3 Release Notes <https://github.com/tahoma2d/tahoma2d/releases/tag/v1.4.3>`_
es: `Novedades de la v1.4.3 <https://github.com/tahoma2d/tahoma2d/releases/tag/v1.4.3>`_

source: `v1.4.2 Release Notes <https://github.com/tahoma2d/tahoma2d/releases/tag/v1.4.2>`_
es: `Novedades de la v1.4.2 <https://github.com/tahoma2d/tahoma2d/releases/tag/v1.4.2>`_

source: `v1.4.1 Release Notes <https://github.com/tahoma2d/tahoma2d/releases/tag/v1.4.1>`_
es: `Novedades de la v1.4.1 <https://github.com/tahoma2d/tahoma2d/releases/tag/v1.4.1>`_

source: `v1.4 Release Notes <https://github.com/tahoma2d/tahoma2d/releases/tag/v1.4>`_
es: `Novedades de la v1.4 <https://github.com/tahoma2d/tahoma2d/releases/tag/v1.4>`_

source: `v1.3.1 Release Notes <https://github.com/tahoma2d/tahoma2d/releases/tag/v1.3.1>`_
es: `Novedades de la v1.3.1 <https://github.com/tahoma2d/tahoma2d/releases/tag/v1.3.1>`_

source: `v1.3 Release Notes <https://github.com/tahoma2d/tahoma2d/releases/tag/v1.3>`_
es: `Novedades de la v1.3 <https://github.com/tahoma2d/tahoma2d/releases/tag/v1.3>`_

source: `v1.2 Release Notes <https://github.com/tahoma2d/tahoma2d/releases/tag/v1.2>`_
es: `Novedades de la v1.2 <https://github.com/tahoma2d/tahoma2d/releases/tag/v1.2>`_

source: `v1.1 Release Notes <https://github.com/tahoma2d/tahoma2d/releases/tag/v1.1>`_
es: `Novedades de la v1.1 <https://github.com/tahoma2d/tahoma2d/releases/tag/v1.1>`_

source: `v1.0.1 Release Notes <https://github.com/tahoma2d/tahoma2d/releases/tag/v1.0.1>`_
es: `Novedades de la v1.0.1 <https://github.com/tahoma2d/tahoma2d/releases/tag/v1.0.1>`_

source: `v1.0 Release Notes <https://github.com/tahoma2d/tahoma2d/releases/tag/v1.0>`_
es: `Novedades de la v1.0 <https://github.com/tahoma2d/tahoma2d/releases/tag/v1.0>`_
